[{"review_id": "Lntbgs8NkAl4R7iSA76yQQ", "user_id": "EOJwlTPy7gy485rOchz5aA", "business_id": "yhoCIkTwHihWejVqGYZ4rw", "stars": 4.0, "date": "2011-05-09", "text": "Pretty darn good!\n\nI ordered a hot ham sandwich with swiss cheese, and my fiancee ordered a hot turkey sandwich. We both agreed that it tasted really fresh and something about the cheese just tasted really good. I was a little apprehensive about ordering my sandwich on multi-grain bread because it looked like it would have been hard and I can't stand hard bread-but it was very soft! I also ordered a pickle, and they give you those giant pickles which was a bonus.\n\nWe both ordered small sandwiches, and I'd say they were anywhere from 6-7 inches long. We were both stuffed when we left!\n\nDefiantly a go again, especially since we won't leave smelling like onion unlike a particular sandwich chain I can think of.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "8bkLb-CMY01VQaigIihfoQ", "user_id": "JiJsVyj2_SgwZz61xBq0Zw", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2013-02-05", "text": "I've been to Stout a few times now and both times I left feeling like I should have gotten more for my buck. The food is adequate, they have a solid beer menu, the service is fine, and they have a few gimmicks if that's what you're looking for (board games, trivia nights, live music sometimes).\n\nThere's not a lot to complain about, it's just not especially unique or interesting. If given the choice, I'd prefer to spend my time at House on Parliament around the corner or try out any of the several new restaurants popping up in the area.", "useful": 5, "funny": 3, "cool": 0}, {"review_id": "NDvicD6GGV0U-RLSjRA0_w", "user_id": "zZtC3Sx0wUCT0ilBKnkyHg", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-03-04", "text": "I didn't know it's been open since September ! Loved everything we are there, will come back ;)  what we liked: Gorgeous Sashimi Moriawase, Sesame Tofu with Sea Urchin on top, \"Better than beef\" Tuna Tartar, Endless Green Tea (hot and cold), Clean bathroom and Great Service ! Lunch time Omakase is 60", "useful": 2, "funny": 2, "cool": 3}, {"review_id": "Zd90BWUnoVW5qlDCoLED0A", "user_id": "7M-rWYRGPfCDnb7tjl7QGQ", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2011-10-18", "text": "OK, I'm at work, and should be productive, doing newsy thing, but I just got back from dinner break here, and MUST take 5 minutes write a review, I'm so thrilled.  \n\nZeitourni Grill opened in July, but it's tucked away in the Earth Fare shopping center in Ballantyne, next to the Dippin' Dots, so it's easily overlooked.  (This was the former location for Quizno's). \n\nWhen I walked in, a super cute woman was at the counter, and helped me make some suggestions on what to try.\n\nI went with the kofta skewer and chicken platter, which I chose to have with babaganoush, and Mediterranean salad. Added a side of falafel. My dining partner had the kibbie. \n\nCan I just say, my Middle Eastern (this cuisine is Lebanese to be exact) experiences in Charlotte have now reached a fever pitch with Kabob Grill being pretty good...then La Shish Kabob being excellent, and now ZG, my all-time fave in the city.  \n\nThe chicken is so tender, so well seasoned...the kofta isn't dried out like most places and crusty, it's springy and moist.  The kibbie, I'm told is new and improved with more spice and is worth trying if you've never had it before.  Falafel side...two nice pieces, crispy fried, and drizzled with tahini and comes with pickled vegetables. \n\nPlatters come with dessert too, so we had two small baklava-esque pastry...extra crisp and flaky, fresh and sprinkles with pistachios.  The perfect two-bite size to end a meal. \n\nThe atmosphere is not shady like La Shish (of course it's not, it's in a spankin' new looking Ballantyne shopping center) and the inside is immaculate.  The owner was super sweet, seemed like an older man you want to sit down with and learn his life story.  \n\nOverall, it's a great casual eatery (order at the counter, wait for food type of joint) where the prices are pretty good.  (Our platters were $9.99 each, including the dessert.) I'll go back for sure when the craving hits!", "useful": 7, "funny": 1, "cool": 0}, {"review_id": "1wIoZZrDjgFKlt7sxNJwJA", "user_id": "cx4-WfPgm1Jxurtd83I83g", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2014-01-03", "text": "The best falafel and hummus I've had outside of Turkey (the country that is)!\n\nI'd love to expound on all the wonderful flavors and how their decore is this or that...but simply...the food is great and exactly what it should taste like.\n\nIf you care about the ambiance and whether it's worth a 40 minute drive or not, defer to the other reviews.  The falafel sandwich alone gets five stars from me.\n\nI do know this:  If I'm in the area, I'd be hard-pressed to choose another location for lunch.", "useful": 4, "funny": 0, "cool": 2}, {"review_id": "5Kt1c0y0u03W-KG3wLsT3w", "user_id": "i8ZU6iDLP5r1dVUCxKVv6g", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 5.0, "date": "2016-03-19", "text": "Came here a couple of times. As Irish pubs go this one is pretty great. The food is a better quality than I've personally experienced at similar places( It's still pub food though). We tried the Lamb burger. The beer selection and atmosphere is what really earns this place a 5-star rating in my book. There is a fair bit of space inside if you are coming in with a bigger group (4-6 people)", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "DO6tppS6WSWNQNnOhV_khA", "user_id": "IZXnSMdOkVdFH-mw6zQBbA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-04-17", "text": "My husband has been jonesing for Zeitouni ever since he started reading the reviews here on Yelp. We went a couple of weeks ago on a weeknight, and I have to say, I'm impressed.\n\nHaving traveled to Italy and Greece, we are not strangers to Mediterranean food. Still, it was refreshing to have one of the young men in the restaurant meet our eyes as soon as we walked in, and ask if we'd like an explanation of their menu. He took us over to the case and showed us their kabobs, as well as their sides. He explained how we could order the different combinations, and then left us to confer amongst ourselves.\n\nWe each ordered a platter. I ordered the chicken kabobs, my husband ordered the trio of kabobs. We ordered different sides in order to sample them all: hummus for me, babba ghanouj for my husband.\n\nWe sat down to wait at a table, and after a few minutes they brought out our orders. Interestingly, our kabobs came with the wrong sides on the plates, but frankly this wasn't an issue since we were just doing a big old taste test of everything we could get.\n\nAn older gentleman (perhaps the owner?) came by to present me with a garlic aioli sort of dip for the chicken. It was DELICIOUS and so garlicky! We asked for more, and asked what they called it. \"Chicken sauce,\" he said, with a laugh as he gave away the secret recipe of garlic and fresh mayonnaise. I don't care how simple it was, I loved it.\n\nThe food was fresh and delicious. The staff was smiling and friendly. I couldn't ask for more from a restaurant. Well - maybe if it was sit down service with menus, but I won't dock them for that. Zeitouni is what it is - a counter service restaurant. Their food shines beyond \"counter service\" which implies almost a fast food style. Zeitouni is not \"fast food\" in my opinion. It's delicious, flavorful and fresh, designed to be savored. So it's a bit of a disconnect, but I forgive them for that because well, if you taste this food, you'd forgive just about anything else.\n\nMy recommendation for dining at Zeitouni is that you call ahead and order delicious meals to enjoy in your home. If you're looking for a tasty and fresh lunch, or out for a quick dinner, it's an okay place ambiance-wise, in which to enjoy it, but the fast food feel might turn you off for a date night out. \n\nRegardless of how you enjoy their food, it is amazingly delicious food that is meant to be enjoyed. We'll be back again and again, but likely with a carryout bag to savor in our home. Zeitouni's food, and it's staff are elevated far beyond the atmosphere you'll find when you walk in.", "useful": 3, "funny": 0, "cool": 1}, {"review_id": "-06TcXCN793xMBvqZyt-vg", "user_id": "jr212HQAwMOXGYKkZLfQvA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2012-08-14", "text": "The next stop on my Charlotte tour of Mediterranean food spots is...Zeitouni Grill!\n\nI work at Toringdon. You know, that office/business complex, right off of 485 on the Johnston Road exit, where the Red Robin and Earth Fare are both located? You know, there? Got it? See it? That building directly across the street from Red Robin? That's where I work. See me waving? Hi!\n\nSo my point to Toringdon is this: other than Red Robin (which, frankly, is pretty meh when it comes to burgers, and the atmosphere sucks) or Earth Fare (which, frankly, their take-out/dine-in options leave plenty to be desired, especially from such a place that supposedly prides itself on health food alternatives that cater to the surplus number of crunchy granolas living in exile from Asheville, and the die-hard fitness freaks that show up all sweaty and red-faced and all jacked-up on adrenaline and self-importance after having done some hardcore yoga at the Urban Active across the street...but anyway...), a quick or at least convenient meal that doesn't require you to get in your car and navigate the fustercluck that is Johnston Road during lunch time, AND you're pretty tired of brown bagging it every day, then what the hell are you going to do for lunch, huh?\n\nThankfully, Zeitouni Grill proves a more-than-welcome respite from the ordinary. And Zeitouni Grill does not disappoint.\n\nThe platters are always a good option. Choose from a trio of Shishes (I just made that word up) - Kabob, Tawooq, or Kefta - or the Shwarma (the \"Avengers\" Special! - You know what I'm talking about!), and you get your choice of two sides - hummus or babba ghanouj (neither will disappoint) and either tabbouleh, fatoush, or the Mediterranean salad. Personally, I love their falafel. I haven't had decent falafel since I left NYC, and this is about as close as what I used to sample when I slummed it on Lexington Avenue near Kips Bay. Simple fare, yet colorful and plenty flavorful, just as I would expect from this kind of cuisine.\n\nKeep in mind this place stays busy during weekday lunch hours, so be prepared to wait about 10-15 minutes for your plate. Worth the wait, though.\n\nI'm here about once a week. But this place is so damned good, I might be coming here more than once a week. I think the shish tawooq is calling my name.", "useful": 7, "funny": 9, "cool": 6}, {"review_id": "jS9fgc3LqDaMW6Kt11qAXQ", "user_id": "gH0dJQhyKUOVCKQA6sqAnw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 3.0, "date": "2018-04-15", "text": "Good quality but small portions. All I can say about this place. Food looks great. But I just don't like going to places that are cheap, but want to charge full price. In my opinion, there's much better places in Vegas that offer better value.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "jc66URJ-3CisFBqxjUQQ2g", "user_id": "fAfGwjh5A_ydd0A4ZdGenw", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 2.0, "date": "2012-08-24", "text": "This place has a low value proposition. It's not particularly nice and all the pints are pricey. Feels like a fancy version of Brass Taps. If you're OK with chain restaurants, you'll probably like this place. Patio was pretty nice, had astro-turf and everything!", "useful": 0, "funny": 1, "cool": 1}, {"review_id": "d9zzpnsZjkS4xRco9H4X0w", "user_id": "HE1C_JR8rF8Oht4W0mGgmw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-10-31", "text": "What a nice little restaurant tugged away on a strip mall near Charleston & Jones.  We went there for lunch (served only on Thur and Fri) and it was so delicious that we came back for their omakase dinner.  Not a fancy place but just tasty food and very fresh fish.  The chef (owner) and his wife are just exceptionally nice and friendly.  This place has become one of our weekly stopping point.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "uvtaxyBc5Y950zWAXVgsIw", "user_id": "rrCvRjWHB0joS557FsWTog", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2012-01-09", "text": "After reading the reviews specifically about the availability of board games, I decided to try it out.\nI really feel the owners need to drop the 'Pub' from the title. The feel is definitely not the standard Pub environment. It has a hipster lounge/cafe/restaurant feel that attracts friendly drinks/dinner dates. \n\nAlas, the selection of games are very few but still not half as bad as waiting for 2hours. In the cold. \n\nThe entrance is main level and has a fireplace and piano to the far right end of the room. This gives a really cozy feel. Perfect for a quiet dinner on a cold evening. The all around wood furniture gives a warmth about the place. You can walk in and sit anywhere you like - which hones in on the casual atmosphere of a bar. While the staff and upstairs bar section brands a trendy spot with the plush couches and balcony setting overlooking the main quiet dining area. They have a wonderful balance of laid back and trendy. It might have something to do with the alluring candles or the super friendly staff.\n\nThe waiter was a lovely chap with a heavy accent. I couldn't make out exactly where he was from but it could've been Finnish. Nevertheless, he was very friendly and accommodated the 3 of us with menus and time to order. \n\nIf this review was solely based on the menu, this place would get a straight 5. We all know too well that awkward moment when you plunge into the world of intimidating new selections at every restaurant, new and old. That moment where the blood rushes to and fro, brain and stomach. Trying to figure out what sounds good, wont dent your wallet and satisfies your papillae.  This place does JUST that. It presents max 6 options in each section. And not overtly complicated or fancy. If you wanted chicken, they have 3 selections that's it. For many that might be a half full type of adventure, but for me, it's efficient and practical. It's the krypton of turning me into a local - even if I reside in Mississauga. Perhaps I'm traditional in that sense but sometimes classics are not to be messed with. Don't come here expecting varieties. It's a bar. It serves Barf-ood options. For once you wont feel the churning. Well done boys. \n\ndrinks: \nFruili - woohoo. Strawberry beer? do you need more incentive to try this? \nFruili\nginger-ale - bottomless refills - cool beans. \n\n\nApp:\nPoutine Sir - ($8.99) This is the standard poutine with the classic fries, cheese and smothered gravy. I cannot believe this place isn't known for the poutine. It is by far the greatest poutine I have had. With each fat french fry and melted cheese chunk dripping with gravy sauce - I mentally made a note to bring my Montreal friends here for dinner. Like mentioned, the french fries are fat and the serving is large so be sure to share. There wasn't as much cheese as I'd hoped but they really know how to spread that gravy bOi! . A delicious app to tease you into mains. \n\nMain:\n\nSteak Sandwich - (13.99) This sandwich came on a francese bun (reminded me of the new square MacDonald's buns- uncomfortably wider than the meat) with a rosemary-radish aioli spread. Toppings included caramelised onions and fried mushrooms.  The steak is just really thin segments of meat that you cannot taste. It might be because of the large ratio of sweet caramelised onions and bread to the meat. The sweet flavour is throughout in this meal. I wasn't a big fan of it. The sides are either fries or salad. Sadly my buddy chose the salad - not knowing, at the time. how amazing the poutine was. You can add cheddar slice for 1.99 - which hardly seems worth it.  The portion is good enough for one. The side salad is not memorable . Not sure if it's not supposed to have dressing. It seemed bland. \n\n\nHells chicken sandwich - ($12.49)  This was the only chicken sandwich on the menu but it's spicy so I opted against it. Mistake!\nThis is a really tasty sandwich if you are in the Sammy mood and prefer a light meal. Even with the bread, it's a deliciously light choice. The chicken is breaded with chilli spices so it's mainly dry. Toppings include tomato,cheddar cheese, onion, lettuce and a light oil-chipotle spread.  You have the option of converting the classic samm-itch religion into a wrap for $0.99. The flavour is well balanced on the bread but I will def try the wrap next time.  My only complaint about this sandwich is that the dry ingredients tend to fall out. I like having all the items of my meal together, so I can relish all the different bits of gusto equally. \n\nChicken Farfalle - ($14.99) This is a plate of bowtie pasta with chicken, fried spinach leaves,grilled and fried red onions and red peppers.The sauce is oil based which makes it extremely greasy. Not in a good way. I could barely taste the herbs because of how lubricated each piece was. The portion is large enough to share but the oil consistency was too much. I really think they should serve a side of bread. Myeh.\ntotal= $85.73\nThe service was friendly&casual. Def will be returning. \n\nxoxo\nM", "useful": 4, "funny": 3, "cool": 4}, {"review_id": "hq2NM4fo-duAcd-IBYzVOw", "user_id": "yQiFb3kzronkldMDomOAWg", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-11-08", "text": "Can't believe this is my first time here considering that the opened 2 years ago! Japanese style sushi house offering fresh delicious fish excellent sushi rice and such a nice staff will most likely become my to go place for sushi. Thank you chef Hiro for the delightful experience.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "BhMMR1Sv_f0jQ74XiQo-aw", "user_id": "0vxYuuiQBvZhApojPINzsQ", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2013-08-27", "text": "Ate here for the first time on a Friday. Was soooo good and inexpensive for the quality that we went back on Sunday. They weren't open on Sunday and no other Mediterranean compared.  That was months ago and we go back every time we possibly can.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Efw_KrXqqdS-ieCjlKgc4A", "user_id": "N-Fk2xynnzYxOK1EhJ4-Sg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2016-08-02", "text": "What a great lunch or quick dinner place!\nWe stopped in here for lunch the other day and left happily with a full belly!\nI had the chicken kebob plate with taboule and hummus. The chicken was very moist and went so well with the taboule and hummus!\nMy husband had the mixed combo plate ( steak and ground beef) with babagaoush and salad. He loves Mediterranean food and is very picky about his meat but he keeps talking about how good his dish was!\n\nWe will definitely be back =)", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "6iLyEdNrYuy_H5FK6MxwMQ", "user_id": "RlpkcJqctkKXl-LO1IAtig", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2014-08-04", "text": "I almost want to try every gyro place just to prove that Greek Village is the best. I can't explain in words how amazing I find this place. I love the american gyro, the roasted red pepper hummus and the feta fries! I always recommend this place to anyone who wants a gyro in Cleveland. \n\nThe extra plus side to this place is that they deliver!!", "useful": 3, "funny": 0, "cool": 2}, {"review_id": "t9qoYsSpHmtaUO23RDHFGw", "user_id": "c55ONBsSZBfaUN5Uhy-qGw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-11-16", "text": "One of the secret gems in Vegas. I was actually reluctant to post anything on yelp because I didn't want it becoming too popular. Great quality fish at an affordable price.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "XSlhNv99HH7Oa_Nz4J_D8A", "user_id": "YOOsYiXGEtGFX_wSeZNcww", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2014-12-11", "text": "This is a great \"Irish\" pub that has a good atmosphere and serves decent food. I have been here for lunch and dinner on more than a few occasions, and it always hits the spot. The service is great and the staff are extremely friendly. \n\nThere is a patio out back for the summer with large benches, perfect for socializing with a group of friends. I also love the open fireplace and the board games they keep on shelves for customers to play as they enjoy their drink.\n\nStout's lunch and dinner menu is excellent, and is always a reliable choice. My favourite is the Cajun chicken sandwich and I'm told their fish and chips is excellent too. \n\nThe brunch, however, is only ok. I dropped by last weekend and had the eggs benedict. I found the home fries very tasteless and the eggs benedict was good but not great. I ordered it without spinach, but overall found it a bit bland.\n\nThree stars for the brunch (will try something else for brunch next time) but a solid four stars for service, atmosphere and cleanliness.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "GDj3tH2fCaLwFaoOSpCtDQ", "user_id": "CcOgdfEJxgrxTAwag5k18Q", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 2.0, "date": "2015-09-23", "text": "Have been here twice now.  First time was rock solid, most recent time was incredibly \"Meh\".\n\nMy wife and I shared a gyro sandwich platter, which came with all the fixings...but the tzatziki sauce had no kick to it (tasted more like yogurt or sour cream).  We also ordered a side of small spinach pie appetizers and they too were not very memorable.\n\nI am a lover of Greek food, and Cleveland is a city that is sorely lacking in that department.  Unfortunately (with our last experience here), I doubt I'll be running back there anytime soon.", "useful": 3, "funny": 1, "cool": 2}, {"review_id": "mWyWWr0nKGwzekcoM-wTcw", "user_id": "gtwM4ijo65AN4DvXdgCu_w", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-06-20", "text": "This is probably one of my favorite sushi restaurants in town. A bookmark that I had wanted to go to for a long time. The time is now (or then).\n\nI've always loved omakase's. You're basically telling the chef, \"You do what you want, and I'll take it\". Take it, I shall. After my first omakase experience at Kabuto, I was dying to try some others. Hearing from fellow reviewers, I was intrigued about this spot. When the opportunity came, I embraced it. \n\nThis place is located in an interesting position in Vegas. It's kinda like between Summerlin and Chinatown. The interior is splendid. It's cool, yet modern.\n\nOnto the food. First, I gotta say. They use the top shelf ingredients you can buy. From the fish, to the rice, to the everything else, it was superb. Not only do they have top quality ingredients, but they have top quality chefs working on them. Expertly cooked foods, and precise techniques of cutting... it was spectacular. What I liked was watching the chefs in action, because unlike most other sushi restaurants in town, Chef Hiroyoshi is doing a lot of interesting and unique stuff when it comes to preparing and serving dishes, it's not just rolls and nigiri, the chefs are doing lots of cool,different stuff.\n\nOur server was fantastic and I couldn't ask for anything better. If you are looking to try an omakase in Vegas, or if you want to try a sushi place that takes things to a different level, I would highly recommend Sushi Hiroyoshi. It's a great place that is making tasty, interesting, and more modern types of sushi that you will enjoy.", "useful": 20, "funny": 11, "cool": 19}, {"review_id": "Od2I8CaYDrCZnvAeS9Zhcw", "user_id": "ANz3yaspyY1Vh0z9P6ekCA", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 3.0, "date": "2016-04-19", "text": "Chicken Gyro can be dry and overcooked.   Mousakka and Pastitsio are very good.   Staff is friendly and helpful.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "m3mKFYS46hK_nKMQwVdj8Q", "user_id": "F7hOtSTmtfYTML5vBlaYpQ", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-09-19", "text": "Amazing Omakase! And for 100 bucks you can't beat that deal! I love Kabuto and Yui but I think this might be my new favorite spot. It's kinda in a random shopping center on West Charleston but not hard to find. Feels like the valley almost. Go give it a try! You won't be disappointed!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Dqfmz6Px2po5S6NPvMsPzQ", "user_id": "2uECxJWkFhekoPkxVQgTsw", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2017-01-06", "text": "A good lunch crowd is a good sign.   The line moved quickly and we found a table by the time we ordered.  Be warned there is little seating and it will be tough for groups larger than 4 to be seated during busy times.  Food was ready quickly, only a few minutes after ordering.  My falafel sandwich was good though I would have liked a few more falafel in the sandwich.  There were as much pickles and tomatoes as there was falafel which seemed unbalanced.  My wife had the chicken gyro which was also good though light on the chicken.  The hummus side was tasty but very little pita was served with it and what we did get was cold.  If the pita were warm and a few more pieces all other issues would have been forgiven as the hummus was delicious!  If the were thing we could say about the place was that we wanted more of the food, that is a good sign.  We be coming back regularly.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "NHOuEEzGZeJkZZmRx1M0sg", "user_id": "bLbSNkLggFnqwNNzzq-Ijw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2015-11-04", "text": "Get yourself to Sushi Hiroyoshi post-haste! This space has undergone a complete transformation since it's days as Sushi Yamaguchi- the formerly messy, cave-like space is now clean, open, and modern. Quality and service are stellar, and I place them on par with a lower-priced Kabuto. \n\nAPPETIZER TRIO: Chef's choice of three different featured apps for the day. Ours were a tofu-uni dish, a seared tuna, and a cucumber-jellyfish salad, all of which were delicious. This first dish really set the tone for the beautiful presentation and careful balance of flavors we would experience throughout our meal.\nRED MISO: A comforting alternative to the usual (white) miso soup, with tofu and mushrooms.\nSCOTTISH SALMON TARTARE: Fresh fish, avocado, salmon roe, and spicy miso sauce, again with nice presentation. It may be helpful to ask for a spoon for this dish.\nNIGIRI: Super fresh. Go with any recommendations you receive. Had great masu, Hamachi, akami, ika, and (an especially amazing) hotate on our first visit. Everything was of great quality, and large thick pieces with lightly-vinegared perfectly-formed rice. \nTORO TAKU: Maki-style roll with fatty tuna, scallions, pickled daikon, and bonito flakes. Possibly our favorite item tried on our first visit. Simple but wonderful.\nUNA KYU: Maki-style roll with golden eel and cucumber. Savory and enjoyable.\nFLASH ROLL: One of the few somewhat-Americanized rolls on the menu, in five large pieces with salmon, tuna, yellowtail, avocado, and masago in soy paper. BF really enjoyed this.\n\nI can't fully express what a gem this place is. Space is small, seating a maximum of 30. Service is attentive and personable, even if seats at the bar aren't available. Fish freshness and quality was much higher than location led me to expect, with generous cuts and proper rice ratio. Dishes and quality were comparable to what we received on a recent trip to Kabuto, at half the price (though none of the grilled dishes). I live dangerously close to this spot and it will be hard to try new places with this spot right outside my backdoor.\n\nTIP: Lunch menu features a daily bento and sashimi combo, both exceptionally well-priced.", "useful": 17, "funny": 10, "cool": 14}, {"review_id": "h9Razvpl8RQZXiQRWFxNZw", "user_id": "GVVLehzorjDfrtdzpotfxg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2017-01-05", "text": "My favorite casual Mediterranean food in town. I've been coming here for almost three years. Every single dish in this restaurant is delicious!! The food is aromatic. The falafel is moist and very tasty. The potato harra explodes with the flavors of different spices. The hummus is smooth and addictive, and all the vegetables taste fresh. The grape leaves are also good. The gyro is my favorite and for. Forget to get some baklava for dessert!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "hHBkXjI8mDj20oGBBIS6lQ", "user_id": "gaPf1qNX7PAf14wIPBUmVg", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2015-04-12", "text": "The restaurant itself is small yet very clean. I've had food from here before and it was good, and this second visit was even better.  \n\nI got my order for takeout and had my food in less than 3 minutes and it was super affordable. \n\nI got the American Gyro on a wheat pita and the spinach artichoke dip with warm pita wedges.  Both dishes were very hot and fresh. \n\nI'll start with the spinach artichoke dip and pita wedges. You get a generous serving of the dip with warm pita pieces. I found it very hard to stop eating the wedges on the way home they were that good. The dip was delectably salty like a good spinach artichoke dip should be. I wanted to eat it with a spoon. \n\nThe American Gyro has the traditional beef/lamb mix, a sauce and topped with onions and tomatoes. There was a generous portion of gyro meat and plenty of that sauce. It was absolutely delicious. \n\nI saw that this establishment is open until 3am on Saturdays which I am sure they make a killing on these days because these gyros would be the perfect ending to a night at the bar. \n\nI can't wait to return again.", "useful": 1, "funny": 1, "cool": 0}, {"review_id": "CF5QpB9ppX08VdDROPj-Gw", "user_id": "m-2OHy6aP26oefPIiiTocg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2011-12-16", "text": "Haha j'ai voulu tester ce bar qui proposait des soirées pub quizz comme on en connaît dans les pubs parisiens. Mais bon j'ai vite compris que si vous n'êtes pas élevé dans la culture canadienne, il est quasiment impossible de répondre aux questions.\nLe Stout Irish Pub reste malgré tout un super bar servant une vingtaine de sortes de bières différentes et de très bonnes poutines.\nClientèle d'habitués ici venant toutes les semaines s'affronter à des sessions de pub quizz qui s'étalent sur plusieurs semaines.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "YM2-aHiKvgX-s0bAmiVNww", "user_id": "FVRAb6vqzkPfr1DyM-8kGA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2015-11-16", "text": "Let me just start off by saying Chef Hiroyoshi and his wife Mayuki(?) are super sweet and genuine people\nI made a reservation for two to sit at the sushi bar for Omakase. When we got there there was no one in the restaurant. And the sushi bar looked closed. Right away Mayuki apologized and explained that there was a leak above the sushi bar so they had to close their restaurant for the night, but they stayed open just for us since I made a reservation!! We offered to reschedule but she insisted we stayed. Talk about customer service and going above and beyond! Well we did not get to sit at the sushi bar but that didn't matter because we felt VIP having the restaurant to ourselves being served exclusively by Chef Hiroyoshi and his wife!!\n\n*i wasn't going to write a review because it's been over a week now and I can't remember what I ate but this restaurant deserves their 5 stars!!\nIt was all delicious amazing traditional Japanese sashimi/sushi. \nI would recommend making reservations and dining omakase!", "useful": 5, "funny": 2, "cool": 2}, {"review_id": "KfGOj5CiYqpROXzIgwzBrQ", "user_id": "dqfCjksa09IAWvnUObGhPQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 2.0, "date": "2017-01-01", "text": "This place is very disappointing lately. The feta fries are seriously a joke now, barley any cheese, it was also unmelted shredded cheddar...wtf happened to provolone and feta? Like it's called feta fried and you served me fried with in melted cheddar cheese and tomatoes.\n\nAlso if you're closed, maybe tell Grub hub and other delivery services, just a tip. It's says they're open when they're not.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "gxUj-xe2p70qszFI4NVxJw", "user_id": "gwIqbXEXijQNgdESVc07hg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2012-05-19", "text": "Passed by this Pub and then recalled having it on my bookmarks so decided to drop in. \nIt was the weekend and though I was running late for lunch I was expecting a crowd here. Surprisingly not much happening here and I walked around and spotted a patio. A small cozy space but nicely done. \nBeer list though impressive for draft is limited to mostly local stuff.\nBottled selection is a bit better but not much. Very few Belgian beers.They were serving the brunch menu when I arrived so after going through the menu ordered the french toast. I also ordered a flight of beer as I wanted to sample stuff.\nService was bit slow even though they were not busy.   \nThey gave out free scones which is appreciated. \nMaybe I chose the wrong beers as the flight was forgetful. Finally the french toast arrived. Impressive to look at it was huge cube of soft bread with some strawberry custard stuffing and side of maple syrup. Potatoes were cubed and fried. Taste was decent but not eggy enough.  So food is decent \nIf they improve the service I would bump them half a star. \n3 Stars overall.  Odd area for a bar like this but I can see it being popular for this area.", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "ubVrVp2r5Jm0K-Iad2UvIA", "user_id": "QyScH8Ef-7RosWQch4Ikcg", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2012-11-30", "text": "Tasty and affordable. Not the best Greek ever but it's also not expensive so you get a good meal for the price. Honestly, huge portions. Bigger than necessary but I'm fine with that. Very nice employees and a very small place so i always get carry out but if you're nearby, it's a good place for a meal.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "Zod44gesCW9eregRmuflpw", "user_id": "aaO0SvyNh8sOLmFFRonlkw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-08-25", "text": "Authentic and different then any restaurant in Las Vegas. If you like sashimi and sushi that's the place to go. The cod was amazing I ordered three of them and the hamachi kamma was great. The sautéed mushrooms was great but the scallops and blue fin was to die for. Definitely going back but next time will go to try new specials.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "itHSqllCGtywOzOY5jKBAA", "user_id": "1fNQRju9gmoCEvbPQBSo7w", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2015-11-09", "text": "Came here on Friday after a meal at Kingyo. Nice little Irish spot in Cabbagetown. I had a Call if Cluthulu Stout that was delicious! Nice hints of fruit to cut the stoutness of the beer. The server was nice enough to give me both a sample of that and the red ale that I was debating between. Great little touch to help me make the right choice. I'd love to go back. \n\nRecommended.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "LhpE6xg3ImGmkNYUN4JkzQ", "user_id": "l8N9a8BG2G1PHazbieOqng", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-11-15", "text": "Finally got to eat here.  Been bookmarked for a year.  It didn't disappoint. Very fresh sushi. Tried the Omikase- totally worth it.  It's close enough to Kame Omikase.  My 11 year old loves his Salmon negiri- he commented that it's as good as Miku in Vancouver BC.  \n\nService was excellent. No reservations needed. Next time will try to seat at the bar.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "m2G_gWWIqOrrruceWdPfHg", "user_id": "Aa5bZsoNRHgYkkw193Wu6A", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 5.0, "date": "2015-03-18", "text": "Straight up pub food, but good straight up pub food. I actually crave their deep fried pickles. Damn, they're good. Excellent beer selection. Kinda love this place.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "ViSQ6ZeUoBBVV_rC1KrqTg", "user_id": "AvC5XQAElcGAAn_Wr5auEg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-07-17", "text": "I'm completely enamored with Zeitouni's simplicity. By far one of the best Med restaurants I've visited in quite some time and at a pricepoint that is hard to beat. We've passed by this joint on multiple occasions and, by the number of outstanding reviews, we couldn't wait any longer. \n\nWhen I say simple, it's in the best way possible. Not glitz and glamour for Z's. A few simple murals on the wall depicting a map of northern Africa and most of the Mediterranean...and that's about it. It's all about the food here. Just how it should be. \n\nThe staff is very kind. Even courteous enough to ask if you've ever \"experienced Mediterranean food before\" and walk you through the different preparations and choices. Much of which can vary slightly, but always good for a refresher. \n\nOnward to the meal! My wife got the Falafel platter. Perfect orbs of crispy outside and warm, soft, flavorful inside. Not dry and also not overly moist. Topped generously with a mix of veggies and fantastically mixed tabbouleh. Finally! A place that uses bulgar wheat! The pickled veg was incredible. \n\nI ordered the mixed platter. All three skewers they have with a dashingly colorful salad and pita/hummus. The chicken by far has the most flavor. Charred bits from the grill and marinated in something that fell from the heavens. The lamb and beef skewers also retained a ton of flavor. All of the spice mixtures are pungent but not overpowering. Perfect balance from three equally delicious animals. \n\nThe place is clean, busy, simple and has flavors that will make you think you're chillin in Tel Aviv. Can't wait to go back and get the Shawarma platter!", "useful": 13, "funny": 3, "cool": 5}, {"review_id": "Hspbkch1G-PKSUHxIsUDtw", "user_id": "w15NByGsVedQLmpydJ7gPg", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 4.0, "date": "2017-06-12", "text": "I wished we sat at the bar because I didn't get the omakase experience at the tables. \n\nI did the $100 omakase and everything was good! The only thing that I didn't like was our sashimi plates were combined. We were given 3 pieces of fish each which made it hard decide who gets the last piece. The nigiri platter was my favorite which had otoro and chutoros! The dessert was amazing. The creme bulee had a thick sugar crunch and heavy whipped cream. \n\nI definitely did leave still hungry and we even had to order more sushi after our meal. I would recommend trying this place once if you haven't been before!", "useful": 2, "funny": 1, "cool": 1}, {"review_id": "5mC3iRmUmjR_cp7jhO3c8w", "user_id": "dY6GK465j-kLlrXalgdsNA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-03-29", "text": "Such a nice change from the typical Vegas AYCE sushi spots. It's located in a strip mall and you will just see a \"Sushi\" sign until you actually pull in and see the name on the window.  There are very few tables here and a sushi bar seating area. We had a party of 10 on a weekday, and had no problems with our reservation. \n\nThe sashimi was SO fresh! You can order by piece or one of the set combination meals. We tried the jewel box, dragon roll, soft shell crab roll, and uni tempura. I'd say the rolls are pretty standard (but still good), uni tempura is mostly just tempura, and the jewel box was delicious. There was a good mix of sashimi, rice and pickles. \n\nOur friends got the omakase, which looked amazing! There was so much food and multiple courses including tofu, sashimi, sushi, cod, and dessert. Definitely order for your whole table if your budget allows, so that everybody can enjoy the meal progression together. We all ordered separately so the a la carte people finished a lot earlier than the omakase meal.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "ZZbBn83G-pYRE4BW2cZP7A", "user_id": "yVkJLz-ydcZ9kzELkRo9yw", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2018-05-26", "text": "So I'm not too familiar with gyros as this was my first one but I'm so glad this was my first one! Greek Village Grille reminds me of a Mr. Hero setup. I like how they don't serve just regular gyros. You can get a gyro bowl, burrito or quesadilla. I opted for the chicken quesadilla but your other options can be a mix of beef and lamb or pork. Because lamb can be a bit gamey, I picked the chicken and it did not disappoint. The sauces on the side add a nice touch. The sauces included their tzatziki sauce and this orange sauce that had like a Cajun feel to it. Both were amazing. My meal wasn't spicy however I highly recommend using the tzatziki sauce if you ordered something spicy. Although they only offer bottled beverages I bought 2 bottled beverages for $3.50 which is very reasonable. Although my quesadilla was $10 I was stuffed when I was through. It was a very laid back place with friendly staff. Highly recommend if you want something quick to go or have time to sit down and eat!", "useful": 2, "funny": 0, "cool": 2}, {"review_id": "MADk5vz4dWS_nry2Ru9fuQ", "user_id": "j6wLUT0ZXi-x0otelYIFpA", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2011-12-14", "text": "What a great place!\n\nI came here for their trivia night, which was AWESOME. \n\nThe staff there is amazing... they're friendly and incredibly accommodating. They were so nice to us, even after we needed to change tables a few times as our group grew. \n\nThe beer selection is also really fantastic. They have a ton of craft brews available, and the staff seem to really know their stuff.\n\nThe only complaint I may have is their food. It's not bad, it's just sort of generic pub food. I got wings and fries. The fries were HUGE and just a bit soggier/thick cut for my liking. The wings were also gigantic, but really really salty, and despite what the menu says, they only go up to \"hot\". I did taste some Moroccan spices on the wings, which I found pretty intriguing, but the saltiness made it really difficult for me to finish them.\n\nIt's sort of out of the way for me, but if I ever need a drink in the area, I'm definitely hitting this place again!\n\nOh and there's free wifi, you just need to ask for the password.", "useful": 3, "funny": 0, "cool": 2}, {"review_id": "FO-jGHUj7RzQmjE1W5rqCg", "user_id": "DjYQCdUMtSDy5-uF8RoEOg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-08-04", "text": "Love this place, great Lebanese food, friendly staff too, reasonable prices.  The best falafel I have had in years!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "ZsLyCdOZ2beAv9re_4V-JA", "user_id": "mg0xz_HZvoDtv2zWm1YHZg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2016-03-15", "text": "I've walked by here many times and recently read they had great shepherd's pie so we decided to try it out.  It was an OK experience - nothing overly exceptional to write about.\n\nThe atmosphere is nice - very cozy with a fireplace and some comfortable chairs.  When we walked in, I thought I would love the place.\n\nWe sat down and I quickly realized this visit was probably going to be mediocre.  First, for an Irish pub they have only two Irish beers which I find very odd.  Also, the food prices were fairly expensive for the area.\n\nI had the shepherd's pie as desired and my friend had the butter chicken.  My pie arrived in a neat stacked fashion but I found it fairly bland and dry.  My friends butter chicken was relatively small in portion size.\n\nService wasn't exceptional and neither was the food.  Honestly, I doubt I'll be back.  Many more places to choose from in the area.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "dbR8sriEmhTkYY22ji5agA", "user_id": "myrcQ3h2G04Gv-ANG_oqrg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2011-11-14", "text": "This is definitely a pub that I've been telling a lot of people about.  As someone who likes to try as many things as possible, how could I not love a place that offers a tasting tray of beer?  You can choose 4 beers from their extensive menu, and you'll get 5oz of each for only $7.50.  That's a deal I can get behind!  I'm not a huge beer drinker, but I still enjoyed trying it - even when I didn't like some of the choices I'd made.  My first choice was actually the worst - so I'm very glad I wasn't stuck with a pint of it!  I'm sure the server was a little annoyed to be serving a table of Yelpers, all of whom wanted the tasting tray - but she didn't show it, so she gets points for that.  The atmosphere is very laid back, and service was prompt even with our large and confusing order.  \n\nAll in all, a great bar to relax with some friends for a few hours, and have some beers.  I'll definitely be back again!", "useful": 2, "funny": 0, "cool": 2}, {"review_id": "ErgBPGza17tryOeHgU3lSw", "user_id": "m2uTGkOKcXqQJSmvsYvtMg", "business_id": "yhoCIkTwHihWejVqGYZ4rw", "stars": 4.0, "date": "2017-11-13", "text": "Only reason i'm giving them a 4 instead of a 5 star is because when I got home, I found out they messed up the toppings on my sandwich.   I did the 'build your own' sandwich with the roast beef.  Even though the toppings were messed up, I still enjoyed the meal.  They have whole pickles too.  Which I had to have.  I got the small hoagie and it was plenty.\n\nRestaurant is nice & clean.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "y3Ovjm47pzopkM2s1uG01Q", "user_id": "UZ-jh-H84fdCt4R2Xugz0Q", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2013-07-19", "text": "I stopped in after work, around 6pm on a Friday. I was worried after hearing about how busy it always is, but I was able to go right up to the counter and order. I decided on the falafel platter which included a choice of hummus or babba ghanouj and a choice of a salad with olives and feta, fatoush or tabbouleh. The hummus was perfect. It comes with 3 pita diamonds and when that runs out, the falafel is pretty tasty dipped in it. The tahini sauce on top of the falafal tasted really great and helped keep them moist. Overall, it was the best falafal I've found in Charlotte. They wear their Yelp best of sticker, well!!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "tc5-fRHKJdA7KQPah165cQ", "user_id": "0KGCdp9W8jz9KJRsABb66g", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2018-02-23", "text": "I don't consider myself to be a Mediterranean food expert, but if Zeitouni is any indication of the caliber of this region's food, then I'm relocating tomorrow. Some of the best Greek/Lebanese food in Charlotte.\n\nI know the following to be true...the meat (all types) is flavorful and never tough; it's absolutely delicious. Even the bed of jasmine rice is delicious on its own. The tabbouleh is awesome and refreshing and their Mediterranean salad is just as good as any. The hummus and pita bread are a some of the tastiest I have ever had. One piece of advice...GET THE POTATOES. \n\nIt's nothing you haven't had before, but it's done to very well every single time you eat here. It's usually pretty fast unless you're going during peak lunch hour. You will never have to wait long any time after 1-2PM. My only complaint is that it's very small inside and does not have tons of seating available. \n\nTry it out and you won't be disappointed. 5/5 because they know what they are and consistently execute.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "YF5m29988WH85WyT6eWtIw", "user_id": "Reuq65EOFI938Yg8xgff9g", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2011-12-21", "text": "Saw all the review buzz and made a special trip this way just to see what the fuss was all about. Sad to say, it was more hype than the quality and experience I was hoping to find. \n\nHusband and I each ordered the Vegetarian Mezza platter. I had the babba ghanouj and the Mediterranean salad and he got the one with hummus and tabbouleh. The grape leaves were the most disappointing item on the platter. For a restaurant that prides itself on freshness, the grape leaves were canned! When I'm in a pinch, I'll grab a can of stuffed grape leaves...so I'm quite familiar with the green oily look left on my plate. The tabbouleh wasn't that great either. Oh, how unfortunate! However, the potatoes were seasoned well, the pita bread was fresh, and the falafel was good. \n\nOn the bright side, the Turkish coffee was made fresh to order and paired nicely with the baklava. I highly recommend getting the two. In addition, the employees were very friendly and the space was small, very casual, and clean. \n\nWhile I made a special trip this time, I don't see myself doing it again. However, I'm not entirely opposed to stopping in if I'm in the area, especially to get my Turkish coffee and baklava combo fix.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "_HbxIULFeDzbCSpVi9j_HQ", "user_id": "8e9MNZR36Pm70RzmXbytuQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2010-06-03", "text": "I had a gyro and an order of spanakopita. The gyro was quite good.  The meat was VERY generous and shaved fresh right off the rotating spit. It could have used a few more tomatoes, but was still very good. \n\nThe spanakopita were awesome!!! Just two dollars for 7 or 8 triangles. They were very fresh, crisp and yummy! Total meal $6.50. I will be back and will try one of their delicious looking dips!", "useful": 4, "funny": 0, "cool": 4}, {"review_id": "4rHa2Yje726pqwhkvnPgsA", "user_id": "pOAOkXP-_TEOj6v0Z0BBew", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2017-02-20", "text": "I've been here several times and I love it! The first time I went I had the shiq tarook which is a wrap with chunks of chicken pickles and garlic sauce.  I usually get the fattoush but I keep thinking back to that shiq tarook and today I got it and it was soooo tasty..I had it spicy.  Chunks of chicken that are tender thick and oozing flavor with crunchy pickles and a toasty wrap. The garlic sauce was not white it was orange-pink I guess since I had it spicy.  I scraped every last bit from the tray.  I had the hummus as a side and it was so fresh.  Very fast casual arm friendly people.  Nice filling meal that didn't break the bank at $9...", "useful": 2, "funny": 1, "cool": 0}, {"review_id": "HX4FzA1bO89MVTes-XhPxw", "user_id": "HFFiM63x9asevqVOZG5GBQ", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2016-10-08", "text": "Our second visit, like the first, did not disappoint. We shared the mixed skewers and the mezza plate. Food, service and cleanliness were acceptable. Light, open dining area occupied with a delightfully diverse crowd.\n\nHighlights include the chicken kabobs and falafel. Taboleh salad also fresh and delicious. Quantities and bread were somewhat lacking.\n\nEverything was tasty but we have been spoiled by the plethora of other Lebanese/middle eastern restaurants in Charlotte, namely Kabob Je Rotisserie.  It also attracts a diverse following but has also much better bread baked continually in a centrally located stone oven (and included in the price of an entree), much more appealing plating, presentation and atmosphere, and is a much better overall value.\n\nStill, if you are in a bind for time and have yen for kabobs, this place is definitely work a try.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "YDG33d74DKaBP_DVOD6ydg", "user_id": "HAv4iHgSyMS4HKwl5hb98w", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2012-02-27", "text": "I love this place. Very solid pub.  The lower front area feels like you could be chilling at someone's house with the couches and fireplace. I've been here a couple times now and the service has always been quick and pleasant.\n\nThey have a respectable beer selection, and decent pub food. It's standard bar fare, but if a place like this doesn't screw up the chicken wings, I am a happy camper!\n\nThe highlight of this bar is the Trivia night on Tuesdays.  It's a really laid back and fun style with varying level of difficulty that gets everyone involved.  Every table is passed a booklet and a pen to write the answers to the questions given by the MC.  At the end of the night, each table exchanges their booklets with others and the answers are corrected. Once tallied the winners get fun prizes and gift certificates.", "useful": 2, "funny": 0, "cool": 5}, {"review_id": "ps_q-g8th4VEXVNmIwKgpw", "user_id": "V4TPbscN8JsFbEFiwOVBKw", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2016-07-06", "text": "My colleagues and I had went for a celebratory dinner at Zakkushi; it was still early so we decided to look around for a place to enjoy a pint. We decided on Stout Irish Pub. From the exterior, this place looks like an average Irish pub. I wasn't expecting much; however, as we walked in and went to the patio ... wow! It was so cute and cozy; the astro-turf was a good touch. I love the ambiance of the outdoor patio. Their drink menu is also quite extensive; it was actually overwhelming because there was so much to choose from. \n\nGood for: patio, drinks", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "RB_5FlyEDGfri2sQ8dsQTg", "user_id": "g4ptSwb0C1b7PYDo8lHDpQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 3.0, "date": "2017-03-02", "text": "As far as gyros go it was on par with any others I've had. Its nice they stay up late since its right next to The Richland, which doesn't serve food.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "TK4S3Xa7YYLb6wNfKpkayw", "user_id": "Ug0ujy9-jd0Oc2nk3KIotA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2012-11-14", "text": "OPEN Kitchen!  Consistently Good Food and Always Great Service!\n\nOne of the things I LOVE most about this place is they have always allowed a simple substitution!  Listen yelpers:  Do you really want rice with that!???  No! ! !  Get something GOOD!  Potatoes Hara is my suggestion or maybe you could have an original thought, NO don't do that, copy me, PLEASE Copy Me and ask nicely : \"would you please substitute the Rice for Potatoes Hara\"?  You will not have to drop my name... They know me as Matt (not Super Drew, just Matt and not Just Matt... Matt... Matt who likes Hat (s)K!\n\nI have eaten almost everything on the menu and I have eaten almost all of it twice.  Wraps are Good, Kabobs are BETTER!!! \n\nFattoush was A-OK better than many!\n\nTabouleh has been prepared to order each time.  I have heard that it is better (proper) to have it this way, as opposed to pre-made.\n\nAll the Desserts are Good or Better... get the Baklava! \n\nLebanese Coffee, they say (like Turkish Coffee with Cardamom).  So it is Better than \"Turkish Coffee\", because I like the Cardamom (Might make a List about it)... Since this is MY review I do not need to say \"it is my opinion\" this is MY Review!   It takes me about 6 hours to drink one serving (you get TWO) and I can not spell anythij for the rest of the day... My Doctor said it is common, though not as common, which is a GREAT way to say Rod0, you are a weirdo, hmmm, ok, I'll take that as a compliment!", "useful": 3, "funny": 2, "cool": 2}, {"review_id": "nPMmoNHu3b1FfiOOZY0eTA", "user_id": "nRdnmZZ6Gts0io2ZteeL0Q", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2016-07-07", "text": "Went here with a few of my friends on a week night, it was pretty dead but I had some sort of jalapeno sandwich with a red pepper soup, which was delicious! Great ambiance and friendly service, the server was very knowledgeable with the menu and helped me pick out that oh so perfect sandwich. They also have sundaes, an extensive drink menu, and board games. Definitely give this place a try. If I'm in the area again I'll be going back for sure.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "_dow945RZUDd2B1zajNr4Q", "user_id": "doGsaahbqD7ePHP19UsDsg", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-04-04", "text": "Casual, yet elegant, with dishes that indulge your cravings for fresh and artful Japanese Omakase, Sushi Hiroyoshi Japanese Cuisine is expectantly wonderful.\n\nI dined at Sushi Hiroyoshi about a year ago for a la carte items, but this time my love had a reservation for Omakase...these are the items we indulged with:\n\nAppetizer Course:\n- Tamago w/ spinach & mushroom and Jellyfish w/ Japanese cucumber \n- Grilled Shrimp w/ egg yolk & Uni butter, Marinated Tuna w/ Wasabi and Uni Tempura w/ Mushroom & Green tea salt\n- Sashimi Course\n- Teriyaki Foie Gras w/ poached radish, lotus root & golden flake\n\nNigiri Course:\n- Hakkaku aka Sail fin poacher\n- Shima Aji aka Striped Jack\n- Golden eye Snapper \n- Chutoro\n- Otoro\n- Abalone \n- Santa Barbara & Hokkaido Uni\n\nDesesert Course:\n- Creme Brûlée & Green Tea ice cream \n\nSushi Hiroyosi seats quietly in a very unassuming area...by a nail salon that certainly looks decent and an un-popular eatery...yet it is its own legend amongst sushi lovers in Vegas. Chef Hiro San along with Kenssan deliver an amazing and memorable meal.\n\n- 2017 Review # 31 -", "useful": 29, "funny": 17, "cool": 24}, {"review_id": "5gQr901GVlc3ASD-MrWevw", "user_id": "sWKaLjpYG6VABf23CXDhyA", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2014-12-02", "text": "Really good place to grab a drink and relax with friends/family. Can get quite loud. Good drink selection and food selection. I recommend this pub for anyone looking for a good hangout spot, there are even board games at the front for you to play with.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "UC8HCEC1QU9jMEiqgtyqnw", "user_id": "yHbrIShhhHkkl20_KGP4OA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-02-06", "text": "??????????????????????????????????????????????????????????????????????????????????????\n\n?????????????????????????????????????????????????????????????????????????????????????\n\nOmakase???????February, 2016???$85/?????????????????????????????????????????????????????????????????????????\n\n?????????????????????????????????????????????????????????????????\n\n?????????????????????????????????Omakase??????????????????????????????????????????????\n\n??????????????????????????????????????????????????????????????????\n\n???????????????????????????????????????????????????????????????\n\n???????????????????????????????????????????????????????????????????????????????????\n\n????Santa Barbara???????????????????????????????????????????????????????\n\n??????????????????????????????????????????????????????????????????????????????\n\n?????Hiro??????????????????????????????????????????????????????????????????????????????????????????", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "IzdLGAM_kF_O9Bdb1-I7fg", "user_id": "ouS-Douov6w19Xly4aKLHQ", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2012-05-19", "text": "I would love to come back here! I spent an afternoon on their little patio, which sort of feels like you are hanging out in someone's back yard :). Someone's tidy and taken care of backyard, with fresh fake turf and little picnic tables. \n\nService was friendly and inviting. They have a great selection on tap! My friends had beer, I stuck to a hot chocolate, as I was nursing a bit of a hangover.\n\nI just liked the atmosphere. We spent a few hours there, laughing and playing jenga. They have a fun selection of board games.\n\nI would go back on a warm day for that lil patio. The inside of the pub also looked good, a little darkly lit when I was there, hence heading toward the patio. But they have big windows toward the front, so I imagine its well lit inside depending on the time of day.\n\nI've passed by the pub on a weeknight and noticed they have quiz night!! (note to self must invite friends for quiz night...denise s, are you reading this? ;)", "useful": 3, "funny": 2, "cool": 2}, {"review_id": "zQ191xBoVpoSeds5k6csMQ", "user_id": "pEMWzZ8qWY1T_K0HUoKDIA", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2013-12-03", "text": "This is a GREAT pub in Toronto. I wanted to write a review of it after the first time we went, but never quite got around to it. Now I'm glad I didn't, because I can add more in this time after my second go-around.\n\nStout is named as a tribute to Murphy's Irish, the only Irish stout you'll find on draft here. I like that the place wants to celebrate \"the other\" Irish beer that often takes a backseat to the popular front-runner, but holds its own with a creamy, nutty flavor and full body without a bitter aftertaste. You won't want to mix Murphy's with cider unless you want something that tastes very, very sweet. Just drink it straight.\n\nThe craft beer selection here is commendable. There is always a Great Lakes beer on cask and the microbrew selections are a nice combination of American and Canadian. They turn over their kegs rather frequently too - a good thing when it comes to the quality of the taste.\n\nThe food? Very, very good. Better than you'd expect for a pub. Fries and Stout burger crisp and juicy, respectively. The bun could've used a little extra work. However, the fish and chips was OUTSTANDING. The beer batter was perfect and the fish meat itself - slimy, almost gelatinous, pretty much perfect in my eyes. Some people may be put off by just how soft and slippery the fish was (did not have a white fish meat texture), but I adored it. It was a large portion and I found myself wanting to finish all the fish because each bite had the ideal texture of crispy to mushy without being oily. \n\nStout it a winter bar. There's a fireplace in the front room, many board games for use, a dark cozy feel, and the attitude that it's best to be safe and cozy with a pint and some grub, rather than outside braving the cold. Highly recommend it for a relaxed dinner in Toronto. We'll be back!", "useful": 0, "funny": 1, "cool": 0}, {"review_id": "6dXTdCt_e42TvXKMxblh_A", "user_id": "J76FnutwAI2PkkB4A-LNwg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 5.0, "date": "2011-11-08", "text": "Checked this place out last week with a group of people.\n\nFirst impression, this place is great.  I liked that everyone in the place appeared to be normal...it is truly a neighbourhood hang out.  The vibe was very relaxed and casual.  the decor was really nice too, hardwood floors, dim lighting, and a beautiful traditional pub bar...wood and polished brass...loved it.  The pub itself isn't very big, but the seating is comfortable.  We spotted some cozy leather chairs and small round tables at the front on our way out...looked like the perfect place to settle for an evening of beer, nibbles and board games.\n\nI didn't try any of their food, but I plan on returning again next Tuesday night, when they have their  weekly Trivia Night...I can't wait!  If you can't make it there on a Tuesday, no worries, they have a ton of boardgames for you and your friends to enjoy over a few draughts.\n\n\nThey have an extensive beer list and most impressive, the offerings feature local Ontario breweries, with some Quebec brews as well.  I tried the beer taster (4 - 5oz glasses of whichever beers on tap that you wish to try) for $7.95.  I know that 3 Brewers also offers this, but the selection of beers at Stout Irish Pub is way more interesting and varied.  \n\nYou can bet I'll be returning.", "useful": 2, "funny": 0, "cool": 2}, {"review_id": "3g42sfvwkxuWOrdrMgaJKQ", "user_id": "6J8koMq6k0GM437QWMHRSw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 1.0, "date": "2016-05-28", "text": "We walked in and the place was completely empty. The menu was very simple. No cute Japanese decor. And the food was very blah. The service was great very nice lady!", "useful": 0, "funny": 9, "cool": 0}, {"review_id": "SN04Mao7pcSiI0PU6pDNrg", "user_id": "oJVkBWeyirjR4h8x2PpN4g", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 2.0, "date": "2018-02-22", "text": "Updated in 2018: quite disappointing to find a hair in my falafel. I just can't stand hair in my food and it is disgusting that the staff isn't utilizing equipments to prevent hair from falling into the food. When I called the location to inform about the hair, they said the next meal is on us. Excuse me but I aint coming back to eat more hair for free!! Get your hair mesh on", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "mX8FveKkt8oWriMnA8rciA", "user_id": "A5RC8s-n2FEbAR5GRUNHDA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 4.0, "date": "2018-03-11", "text": "Had a chance to try their omakase! Considering the quality, taste, and amount of food I received, I think $100 is completely worth it. All of the sushi and dishes served were delicious and the presentation was instagram worthy. Service was top notch. It didn't get 5 stars from me because they didn't serve me more unique/unusual types of fish/seafood like other omakase places I've tried.", "useful": 2, "funny": 0, "cool": 1}, {"review_id": "T-l-wET33D9iXN_DxljfVg", "user_id": "QmethzRyAvZXS9m1UNJpdw", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2016-11-23", "text": "I don't wanna bury the lede, so lemme just start with FALAFEL. Now that that's over...\n\nI was running errands the day before Thanksgiving and needed some grub. Zeitouni's been on my target list for awhile, and I got there around 12:30. I waited at the counter for a good 5 minutes before anyone acknowledged me; to be fair, the four guys behind the counter cooking were slammed, but it was a little annoying. That's where the annoyance ended.\n\nI ordered the shish kabob platter, and the man who took my order asked if it was my first time. When I said it was, he said I had to go with the shish tawooq. I'm never one to question the best a restaurant has to offer, so I went with it! It came with a salad and a dip, so I went with hummus for the dip and asked to substitute falafel for the salad. Best decision I made all day (all month?).\n\nI grabbed one of the few remaining tables, and they brought out my plate just a few minutes later. The man wasn't lying about how good the shish tawooq was - the chicken was grilled to perfection, moist (I know, I hate that word, too), and deeeeeliciously seasoned. However, the falafel was SO good that I debated most of the time I ate about whether I should eat them both first, eat one first and then save the last one, or try to save them both for last. I went with the bookend strategy. The hummus was perhaps the best I've ever had, but the pita was thinner and chewier than I'm used to. Not my jam but y'all might like it that way.\n\nAll that and a water cost me about $11.50, and it was worth every penny.", "useful": 3, "funny": 0, "cool": 2}, {"review_id": "GpoTftJnaPB2NWI2YZZF7A", "user_id": "RFXcKWIaGsqFWK6WJbkl4g", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2011-03-06", "text": "Let's just say we will go back! We were craving Greek food so we went. Gyro was good, salad was a Greek salad can't goof that up. The Greek fries were great and the best was the Pastitsio. Oh, the feta saganaki was very good.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "UOOcNTKIhV_viTeHxxFHFg", "user_id": "qWFc8k7e61RmCJL2xQmWRA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2011-11-17", "text": "Dined in today. Had the mezza platter with beans instead of potatoes, hummus, and fattoush. I love their potatoes, but I try (a little half-assedly) to cut carbs and their beans are heavenly....I mean I've daydreamed about the beans since my last visit. The falafel was hot and fresh. The fattoush is some of the best I've had and the dressing is just right. The pita could have been fresher.\n\nAfter I finished, I ordered the kibbie special to go for my husband. The guy asked me if I'd had it before, and I told him I had and didn't like it. Now I know that I didn't like the kibbie I had before. THIS kibbie, I like.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "bOXjFvMI6D5Ri-1r7pGy3Q", "user_id": "bTpNQ9u8zcphG9rOy750sg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2015-03-29", "text": "Not for brunch really, food was ok, service was very nice, the waitress was super nice too, beautiful clean and cozy place, I think is really good for night life but I was not impress with their food for brunch. The desserts were awesome and a big portion. Maybe will go back to try at night for a drink.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "D5VLF4lOny8v0DqcLQ2YNQ", "user_id": "6m18Kd78MTNcT_O-dI8ZHA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2013-07-02", "text": "Very good, very fresh, very clean, very friendly.  But take note - this is just a lunch counter-type place.\nMy first impression of Zeitouni is a good one, they have a good basis of food.  Now, they need to work on the atmosphere just a bit.\nI could eat there often; it looks like a great variety of more healthy and more indulgent items; it would be hard to get 'fatigue'.\nI wasn't hungry enough to sample a platter, so I only had the falafel appetizer. Their recipe is excellent, and the item was nicely presented with some pita, tomato and sauce.  My lunch mate offered a stuffed grape leaf to me as well.  The dolmas are warm here, which was not expected and the filling is creamy and soft (a little mushy for my liking). Everything was well-seasoned.\nI will definitely go back and try more at this no-frills eatery.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "3tnX7SI6eDn3JPbHhiLxmg", "user_id": "Kj9cFO70zZOQorN0mgeLWA", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2016-02-13", "text": "3.5 STARS\n\nLooking for a place to chill after dinner at Kanpai a group of friends and I decided to cross the street and check this place out.  It was busy on a Saturday night - no surprise there, but we managed to get a table. \n\nThe ground floor has a fireplace and a few tables.  The second floor is tables all crammed in to the point of it becomes kinda uncomfortable if you have to get up and try to squish your way through the floor.  I also found that it was pretty hot - like no ventilation kinda hot.  I was sweating by the end of the night.\n\nThe late night food menu is tiny but the drinks menu is extensive.  This is definitely a lively place, loud and boisterous.  Don't come here expecting to hear your friends!  This is most likely due to the fact that they offer board games for play so you can imagine how loud things can get.\n\nA fun place to have an evening out where you can bring your A-game one (pun intended)!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "Kjs8U4b5QKbPDdXiVVrlQw", "user_id": "ic-tyi1jElL_umxZVh8KNA", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2018-02-28", "text": "Great to see an establishment this busy on a Tuesday night..  I had a headache and felt like I 'escaped' after about 15 minutes inside.  Different strokes...  maybe better for a group than someone looking for relaxed pub.", "useful": 3, "funny": 1, "cool": 2}, {"review_id": "lQgAyf6MDp4Rq6odAMEpAQ", "user_id": "5DcDiCJETu5EklCDdXtnLw", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2013-03-11", "text": "I like the vibe on this place. It's not pretentious and the crowd is local. Extensive beer list that can probably rival Bier Mrkt or Allens.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "cFXyRgNRXa2U7DTCmvH_jw", "user_id": "3nDUQBjKyVor5wV0reJChg", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-06-22", "text": "Sushitarians, add Hiroyoshi to your rotation, especially if you are the edomae/omakase style fan...NOT the yum-yum sauced, \"screaming orgasm\", \"Vegas Roll\", \"Tastes Like My Ex-Girlfriend\" kind of Western style sushi fan, you'll be sorely disappointed!  I'm surprised this place isn't busier, as really great sushi is being made here.\n\nGreat service and quality ingredients are what you'll experience here. We met up with fellow San Diego Yelper Debbie S. and her friend to have dinner before they flew out, and Debbie suggested Hiroyoshi, and I've had it bookmarked for awhile, so that was our plan. \n\nMy suggestion to you? Order the Omakase, sit right up in front of Chef Hiro, and enjoy the show, as well as his creations as he assembles course after course. You can customize your omakase, but the $85, all-inclusive package is the way to go. It includes an assortment of appetizers, a few cooked items, an assorted sashimi platter, great nigiri assortment, and a dessert trio to finish. My pictures do not lie, but pictures also don't do justice... you gotta experience it live!\n\nHOT TIP: If you don't see a certain item on the menu, don't be afraid to ask...I LOVE Uni and ankimo, so I inquired about it...Our waitress was surprised that I liked Monkfish Liver, and I was also happy to know that they had Hokkaido Uni from Japan, which both made an appearace in my omakase experience. Definitely a must when dining in Vegas!  ALOHA!!!\n\nShaka Meter:  \\uuu/  \\uuu/  \\uuu/  \\uuu/  \\uuu/  5", "useful": 22, "funny": 12, "cool": 17}, {"review_id": "YYV3eueLzrrxboNmcxgyKQ", "user_id": "ga_05brEylDLIabc3lZOgA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-08-23", "text": "Wow! My first omakase style meal in Las Vegas and I absolutely loved it! My Japanese mom enjoyed it too. The service here was simply fantastic and the food was melt in your mouth delicious. \n\nAs long as you're not a picky eater and are willing to try something new, then Omakase is the way to go. The chef selects your entire meal selection which is so much fun. You never know what you're going to get and everything compliments each other to perfection. Plus it takes away the stress of having to choose what to eat. You just get to sit back and enjoy the amazing food.\n\nThe sashimi was super fresh and reminded me of eating in Japan. This place has the flavor I've been looking for in Vegas. I'm so happy and excited that I found this place (thanks to my Yelp friends and their reviews). I honestly can't wait to go back and try some more.", "useful": 6, "funny": 3, "cool": 4}, {"review_id": "AVCzWeXjPrCy1r3XkB19jg", "user_id": "uNuPyXHbbtHnhWhPLamESQ", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 3.0, "date": "2016-07-27", "text": "Last dinner in Vegas for the summer so we wanted something good/nice. Decided to give this place a try in hopes of finding something better than Kabuto. Unfortunately, both of us were unimpressed and underwhelmed. \n\nWe ordered the top tier omakase set (I think $88/pp) + edamame and miso soup. The appetizer portion of the omakase just did not fly with me. Some things were a little too fishy and others just did not compliment the dish. I was like huh? The sashimi came on this huge, beautiful platter with generous amounts of fish. Honestly, I can see why people like this place because the sashimi was some of the best I've ever had -- extremely fresh!! The sushi portion is what threw me off... while everything was decent, nothing was mind-blowing. I want to be mind-blown during an omakase experience, damnit! Fish was too traditional and nothing was exciting. 4-5 stars for quality, though.\n\nService was out of this world. They were very Japanese-y in their polite mannerisms. We were checked on frequently and was told thank you for everything. A+!!!\n\nHonestly, if I come back I'd sit at the bar and do sushi ONLY. Skip the apps!", "useful": 3, "funny": 2, "cool": 1}, {"review_id": "M4-XAtPa8C869YNSdx18Lw", "user_id": "FFFeLM5rk29RZn6FmGlHYQ", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2013-08-27", "text": "Pubs in the city are a dime a dozen but ones like this are a real gem.\n\nI came for Sunday brunch and was thoroughly surprised by the food. Spot on! Perfectly prepared even the sausage was not your typical pork sausage. Which means these fine folks know those ones are shit. \n\nI was so excited that I ate it before I realized I hadn't taken a photo ! \n\nIt's still pub food but well made pub food.\n\nService was great. Atmosphere was comfortable and friendly.\n\nThey even have board games . I would definitely come here again.", "useful": 0, "funny": 0, "cool": 1}, {"review_id": "33iitFapPH30F4Js0taYWg", "user_id": "Ekw7wuUTX36BtcPP6XnA-Q", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2015-12-13", "text": "We saw Zeitouni at the last second and decided to try it.  It was a great decision.  Had the grape leaves and the Gyro platter.  The food was really good and I will return.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "MNXH4pdtBiR-JOOz_1plNg", "user_id": "7AGLlj5YzqdBfCPiZCa1mQ", "business_id": "yhoCIkTwHihWejVqGYZ4rw", "stars": 4.0, "date": "2011-08-02", "text": "\"Everything that we are and do reflects our old-fashioned values. These qualities are what make the difference between an ordinary sub and a DiBella's sub.\" And I tend to agree, This sub shop blows Subway out of the ocean. \n\nThe office had a catered lunch today. When I heard that we were having sub for lunch I wasn't too thrilled, but never turn down a free meal in these hard times. First thing I noticed when I walked into the lunch room were trays filled with various subs, and EVERYTHING BUNS!!! There was a choice from plain, everything, or multi grain topped with white American cheese, shredded lettuce, tomato, and a variety of meats. We could put on our own condiments. According to the website, the bread is baked fresh throughout the day every day so it's always fresh, and it shows! The meat is also flavorful. \n\nDibella's also has cookie trays. HOMEMADE!!! And man soft, gooey, and OH SO GOOD! Maybe I'll rethink my negative stand on sandwiches. :)", "useful": 2, "funny": 1, "cool": 2}, {"review_id": "WKib8mRp8I-BZ1t1lNZt5w", "user_id": "VnKj044Tt5doqaVDIJbWsw", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2015-06-13", "text": "The Stout gets points for not being a chain like all the other fake Irish/English pubs dotting Toronto.   It used to be a favorite haunt of mine eating there at least monthly, unfortunately the quality has noticeably slipped over the last year.\n\nThe FOOD: They previously had an awesome burger.  They were one of the very few establishments in Toronto that would cook a burger to order.  Unfortunately, they no longer will cook a burger to anything less than medium rare.  It also appears they've stopped grinding their meat in house.  The tasty chipotle aioli with the fries is still good (although costs extra).  \n\nThe other dishes are a bit hit and miss.  The lamb burger is quite tasty, but at $17 is way too expensive for what it is.  The shepherd's pie, which may not quite be very traditional, is still quite tasty.  On my last visit, I had the Grilled Pizza ($15) which was quite a miss.  The acidity of the tomatoes overwhelmed the spice of the merguez sausage.  Perhaps a bit more cheese might have rescued it.  My friend had the beef rouladen ($17) which was rather unremarkable and completely overwhelmed by the allspice or nutmeg seasoning.  The spätzle accompanying it seemed to be pan-fried, which is rather strange.  \n\nThe BEER:  They have mostly Canadian craft beer, with of course a couple Irish and more worldly options.  I would say 3 years ago, they were much more competitive with their craft beer selection.  Unfortunately, in my last couple visits, I've been hard-pressed to find much I wanted to try.  Their regular taps are filled with things like Steamwhistle, Lugtread, and Creemore which are pretty much everywhere.  Sometimes they have some interesting beers in their rotating selection, but the pickings have been slim the last few times.  Prices are a little high--consistently pushing $8 plus tax.  Good bottle list though.\n\nThe SERVICE: I have to confess it's been super awkward the last couple times.  For example, when the server noticed I'd eaten about half of my grilled pizza, she asked if I wanted it to go, and I declined.  She looked at me puzzled and asked if there was anything wrong, and I just noted that I wouldn't order it again as the flavor just wasn't quite there.  But it was all very uncomfortable and tentative.  Also, they used to always offer a small sip of a beer to help you make a decision on something you hadn't had before, but the last couple visits that practice seems to be discontinued.\n\nOVERALL, the Stout is still decent, but I've been much less satisfied with the food and beer the last few visits.  It's a good option if you live in the neighborhood, but I would no longer recommend going out of the way to eat here.", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "-b4Ql20_vnvNvuqXQZImwQ", "user_id": "YFHrehv9nlluLMmn7eUUqw", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 2.0, "date": "2017-02-11", "text": "Zeitouni Grill, meh- it was my second time at this restaurant. Not bothering to ever go back. Number 1- It was empty at dinner time..that should have told me something..Number 2 -The food is just not up to Par,,,,Just not great or memorable. We sampled a lot of the menu again. The tablouli is all parsley, no Bulgar wheat at all, it was actually the best dish of all the things we tried. The Falafel was over fried and tasted like it was stale. The Gyro was so skimpy on the amount of meat, I was very surprised, it was all lettuce and tzatziki sauce. We had the Potatoes Harra, which was fried potatoes with Lemon, garlic and olive oil, they would probably have been good if they were warm..it was just room temperature and they also tasted old. The Baba Gohnuji was creamy and had a nice smoky flavor. The thing I cant understand is that if there was no one in their why wouldnt the food have been freshly made..it was like some Lebanese Aunt came the week before and they were heating up all the food she made. Just not very good at all....Sorry....", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "ATUFhHETaorJwwooauBt5A", "user_id": "vKUlUXLVylwdttu7h1_Y5Q", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2013-02-06", "text": "Nestled in a strip mall you might overlook this place.  I had the chance to stop in yesterday to try it out and I wasn't dissapointed (completely).  Upon walking in I got the sense this place is popular based on the number of people in line and waiting for food.\n\nThat was probably the biggest drawback, the wait.  But the chicken I added to my greek salad needed time to cook I suppose so that was ok.  They did mess up my buddy's order so that wasn't exactly a good thing though.  My salad was great, fresh and cheaply priced in my opinion.\n\nIf you're coming in here for the atmosphere or the interior feel, you may, no you will be dissapointed.  I took my order to go.", "useful": 3, "funny": 4, "cool": 3}, {"review_id": "PABuTBFs4XNGnBm8i8ssRg", "user_id": "aomkMAGFrL-gD6cqQjB4bw", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2012-10-15", "text": "Being pretty close to my place, hungry and in search of a quick pint or two, we descended on Stout.  It's a warm and inviting decor with large windows and lacks the loud, kitschiness of your typical pop Irish pub.  They also have a small collection of board games you can borrow.\n\nAnd the brews - oh my.  Yes, there are plenty of English and Irish brews.  But there is a very impressive selection of local craft brews in bottles and on tap.  There always have at least one cask from Great Lakes.  And they have Murphy's rather than Guinness on tap.  That's a huge plus in my books.\n\nThe dinner menu looked amazing as well... from my computer before I realized they were only offering late-night items.  Being a bit dejected, we ordered some perogies, expecting some limp-wristed excuse for food - to our surprise, we got a big bucket of delicious, crispy fried perogies for $8.\n\nSo - plenty of craft brew selection, inviting decor, and cheap and tasty food?  We have a winner.", "useful": 5, "funny": 2, "cool": 2}, {"review_id": "pnE6oDmmwywelF8jSD8syg", "user_id": "mOVyk3O18VY5nrUMTZgM1w", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 4.0, "date": "2013-11-01", "text": "Everyone goes here for the huge selection of beer (and maybe convenience of location); I went to hang out with my colleagues and for my usual margarita. Heh. I hear this pub's got good grub for lunch, but since I've never been, I can't verify. \n\nFew things that made my experience \"Yay! I'm a fan\" \n\n1. $5 Appetizers during happy hour - we ordered nachos, perogies, deep fried pickles and sweet potato fries - all of which were very good (quality and quantity inclusive)\n\n2. My collegues raved about the beer and the selection... and they are quite the drinkers, so I can assure you it was good\n\n3. I had two reasonably priced Blackfly Margaritas - $6.25 per bottle... and each bottle made for 2 glasses. \n\n4. My glass came un-rimmed. So I asked the server if he could rim the glasses with salt. And he was very courteous about it... got the salt rim with 2 kinds of salt.  \n\nWhy it missed 1 star then? Merely because I got a beer mug for my Margarita. Which was weird because my colleague was drinking pinapple beer from a cocktail glass. I am sure they had more cocktail glasses... \n\nAnyway, totally going back for lunch sometime!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "MA62JeGS--0KIE-GoH3feg", "user_id": "sa5zd7bwBQzajQB48Y9SUw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-06-20", "text": "I'm a little behind in my reviews but I saw this place and I knew I HAD to go for my birthday. My husband and I came here for lunch because when you have two kids dinner is not an option. My hubby made the reservations which was not needed but I would definitely recommend if you are having dinner there. We were seated right away with the only two spots at the bar with plates. The chef just started our omakase experience as we sat down. We didn't know what to expect but we just went with the flow. We started off with a cold dish which wasn't my favorite but then he started getting to the real deliciousness of the meal. Different types of amberjack, salmon, yellowtail, 3 different types of toro, etc.... which was all fresh! I loved pretty much everything and the presentation was unbelievable. I would definitely recommend coming here if you want authentic sushi (not the rolls, but you can order that) and not drive down to the strip. I was full afterwards and although it was pricey for lunch it was well worth it. \n\nP.S. Get the peach jelly drink...the texture is crazy in your mouth but in a good way!", "useful": 2, "funny": 1, "cool": 2}, {"review_id": "_FyMlGhpRzi1trNZMd9gKw", "user_id": "25QzG8_MT4zr4JiglZI8dQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2012-02-08", "text": "Awesome local Greek place. I've gotten takeout from here a couple times, and they totally remind me of my now-closed favorite gyro shack from my time in New York City. I am very, very happy to have a sweet place like this literally on my drive home from work. Quality and quickness are great, as is pricing. AND they offer a seven-pound mega-gyro challenge that I will take when I want to throw off the shackles of any semblance of a healthy lifestyle.", "useful": 3, "funny": 4, "cool": 2}, {"review_id": "P73PRUzdanojylAuRvzfxg", "user_id": "C_hUvw2z0R-Rv0yZb6QCZA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-03-11", "text": "came here based on yelp reviews. very friendly service. clean and simple atmosphere which I prefer. I ordered the omakase. most memorable - monk fish liver (WOW!), four mushrooms dish was very flavorful, had three kinds of uni (Japanese, Santa Barbara, and Canadian... my favorite is the Japanese). Toro literally melts in your mouth. very fresh fish. worth going back and recommending. I hear it's comparable to Kabuto. I have never been there but will be going next week so I will have something to compare. omakase came out to $100, but you get more than enough food and it's worth trying at least once. will be back!!!", "useful": 3, "funny": 1, "cool": 1}, {"review_id": "wUFNGMzlJxwpwrfIWFpgcg", "user_id": "KOHvhD69T7rlnK7zKO2wmA", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 3.0, "date": "2014-02-12", "text": "Visited twice now. Beers are pricey but a very large selection to choose from. Appetizers were hit or miss. The deep fried dill pickles are amazing but the bean dip and nachos weren't great. Service is a little slow and I noticed one of my glasses was dirty after I had drank most of my beer. All in all a fun place to come to but mostly because of the board games.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "3xqaMRvi_r2xveJQtZ20Hw", "user_id": "hy4uEHgITEfzxrXzyDhCRg", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 1.0, "date": "2015-08-01", "text": "Place is full of arrogant morons.  Tried to order and got put on hold for 10 minutes....when I called back I got attitude.  Miserable customer service and I wouldnt give them a dime.....", "useful": 5, "funny": 5, "cool": 4}, {"review_id": "XVWkzwBhYXSh-HP901SZZA", "user_id": "9JXtMjyw_tyjcBmnhMSvoQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2011-11-29", "text": "Plenty of options when it comes to the gyros which are a solid product. Open late and will not disappoint.", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "Wj7qRw3cjvlmhPXENsYATA", "user_id": "nDV-9a37-ckn73jdZIuIXw", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2011-11-12", "text": "Wow, all five star reviews so far!  Guess I won't derail the train on that... my only complaint is the classification here on Yelp of this restaurant being in the \"Quail Hollow\" neighborhood.  Although it's not officially Ballantyne... it's closer to there than Quail Hollow.\n\nAnyway... we just stopped there for a quick lunch pick up and got the Shawarma \"sandwich\" and a Gyro and both were VERY GOOD!!  My only regret was not getting a second Shawarma or fries to go with it.  It was delish!!  The Gyro was loaded with meat and very nicely seasoned.  We will be going back there again... and again.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "ZAD0bP19qLWDddv2tS4wgA", "user_id": "swUxTfJ96XZJ0ufmljJiXQ", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-11-21", "text": "If I could eat at Zeitouni every day of the week, it would not be often enough. Everything I've tried there has been simply outstanding. \n\nIt's not a fancy place. You walk up to the counter, place your order, and wait. You might wait a while for your food, in fact (because they have a small grill/kitchen/prep area and a line out the door of hungry customers). Finding a table is a bit of a chore, too. Just imagine you're in the middle of NYC awaiting the best Gyros (or other mediterranean treat), and you will feel better about standing around waiting on a table in the middle of a strip mall in Ballantyne. : )\n\nI've tried practically everything on the menu, so I can't comment on everything. But.. the standouts to me are: Potato harra (on the side dish menu), Gyros (of course, get the platter, you won't be disappointed when you have leftovers to take home), the hummus and pita, the shawarma.. Geez, it's all so stinkin' good, you just have to go and experience it yourself to understand where I'm coming from, OK? And then write me and tell me you thought of it. \n\nBe sure to take some baklava or other sweet treats to go, and buy extra because you'll want to share it with a good friend (if it lasts that long).\n\nDelish!!!", "useful": 10, "funny": 4, "cool": 7}, {"review_id": "q5l5hzBlm9rGt8o3PkeKBQ", "user_id": "3MpzuK6s93p3pIX2GfZCWg", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-03-21", "text": "WOW! \n\nI took in-laws here for dinner on our last night boozing, gambling, and streaking. We always end up gravitating towards Japanese, but I definitely didn't want to pay Strip prices. The reviews for this place was spot on. This a hidden gem of Las Vegas! It's super far off the strip, but well worth the trip to check this place out. \n\nRecap:\n1. Parking - Easy. The restaurant is located in a small strip mall with ample parking. \n\n2. Décor/Atmosphere - Clean, zen. No cheesy decorations or bright, distracting colors. \n\n3. Food - effin' amazing. The thing is, when you first look at the menu, it'll seem like a typical, sushi joint. No thanks. Order off-menu. Request Chef Hiroyoshi to make you an omakese (chef choice). For $65 bucks, I actually felt like I was ripping him off. We had a 7-8 course tasting that ranged from homemade tofu & uni appetizer, toro sashami w/ caviar and fresh oyster , miso black cod, large assortment of sashimi/sushi, etc. We also ordered a side of shrimp tempura, which my toddler threw down. He also loved the toro sashimi and uni/tofu appitizer. The chef said next time we come by, he'll make him a special \"kids omakese\". \n\n4. Service - AWESOME. I can't say enough nice things about the staff. We were very well taken care of and they took the time out explain each cut of fish, chef's background, different types of sake, and flirted with my toddler. \n\n5. Bathroom - Standard restaurant bathroom. Clean. \n\n6. Price - very, very fair. \n\n7. Baby Friendly - Yup! They were very accommodating with my toddler. He got his own place settings, high chair + booster seat. Didn't see a diaper changing table in the men's room though. \n\nOverall, I loved this place. We'll be back, but make sure you make reservations. This place is small and I'm sure it'll be packed, once word gets out.", "useful": 5, "funny": 2, "cool": 4}, {"review_id": "9Lz7xlHJYuJ7M3dDmytYhw", "user_id": "QEpNF4Hag6_W9Stc-1Frvg", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 1.0, "date": "2013-09-19", "text": "I have to first state that due to my diet restrictions, my reviews are based on what I can specifically eat and how/if the restaurant is able to accommodate their menu to meet my needs. This generally means that I cannot eat what a place is known for.\n\n I ordered the chicken kabobs with some rice and hummus. The chicken was dry and had no taste what so ever. The rice was ok and the biggest disappointment was the hummus. It was just bland. \n\nIf you want to sit down and eat inside, there is very limited seating and it was extremely hot inside, so I ended up taking the food to go.\n\nThe people I went with said that the Gyro was great. Based on my meal, I think I will try another Greek restaurant.", "useful": 2, "funny": 1, "cool": 0}, {"review_id": "xYYHzL3qOztpHY8MixNMFg", "user_id": "8zpZLEWweD0Tp6wLTzlZsQ", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2013-03-24", "text": "This is definitely the best middle eastern place in Charlotte. It is very fast, the service is excellent, they make great use of seating in this restaurant and best of all, TRULY AUTHENTIC. My falafel wrap was served warm in a foil, inside it is filled with hearty falafel, veggies and amazing tahini sauce. The stuffed grape leaves I ordered were just perfect, not too sour, just the right amount of oil and very great stuffing that makes me want to call this place a home. Overall this place is great because:\n1. Committed family business\n2. passion for great authentic middle eastern food\n3. very quick service\n4. friendly and knows how to do business right!\n5. Fair prices for amazing food!\n\nThis place resembles everything that embodies a restaurant with a sound business model, bravo!", "useful": 2, "funny": 0, "cool": 0}, {"review_id": "bfTpt8Co5gJrgO2BxcMElQ", "user_id": "RG_ADQ9b-aEPc9fLqmMu4A", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2016-09-21", "text": "It's honest.  It's a Lakewood staple, and they deliver delightful bags of greasy, fatty delicious meat to your doorstep.  The food is good, consistent, and filling.  \n\nI prefer the pork gyro dirty style.  Paired with a side of onion rings means a great gut-bomb to put you to rest for the evening and satiate hunger.  \n\nEating in isn't a fancy experience.  It's tables, chairs, and not much else- but it doesn't NEED to be anything else.  It's a gyro place that stays open late.  It doesn't need much more.", "useful": 1, "funny": 1, "cool": 2}, {"review_id": "4UoROS-iJQGYEJOFxXGh7Q", "user_id": "62GNFh5FySkA3MbrQmnqvg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2012-07-09", "text": "After reading other reviews on Zeitouni, we made a special trip to check out the place. In fact, it was on my list for quite a while since it isn't in my typical neck of the woods.\n\nUpon entering, the owner (I think?) greeted us warmly, which is always a good sign. After a somewhat reasonable wait, the food was brought to the table, and it was a solid offering, but I can't say that we'll be making a trip out of our way again. It isn't that it was bad, exactly - it just wasn't worth the drive.\n\nHad the service of all employees (there were three, I think) been as friendly as the owner, it would have been better. Had the food been as good as the owner was friendly, it would have been better. As it was, it was just decent.", "useful": 2, "funny": 2, "cool": 2}, {"review_id": "Q-MdV4usY2s5PHpdsbOnmg", "user_id": "c30ou-QjV6vcjsFWeCMNTQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2017-12-01", "text": "I'm upset with myself for living so close to this gem and not visiting until this evening. My boyfriend and I decided to finally try this spot and we were not disappointed. The place is very unseeming from the outside, but I love all of the details that go into it. \n\nBefore we went, we tried to look up the menu on their website but were frustrated that it was blurry and could not be enlarged. This was not a big deal as we just went in to look at the menu. \n\nThey have a lot of different options for food but we went the traditional route and tried some gyros. I got chicken based off of all the rave reviews I saw and it was delicious. My boyfriend ordered the American and his was even better! We also checked in and got a huge free order of fries and order spinach artichoke dip with pita bread. It was beyond tasty!\n\nOverall I enjoyed everything about this place from the decor to the food to the super friendly staff. Our order was also ready very quickly. We will definitely be back!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "o1OK0Wys9q7LrSIBtYcYeA", "user_id": "Z0GBHiE7QpWlymLMnUP8SA", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2012-01-23", "text": "Oh yeah! Love me some GVG! I can't believe I never knew about this place until a couple of months ago. Back in March I was having gyro withdrawals after eating at an AMAZING place in Florida (see Plaka review). If only I had known I had a place right in my backyard that was competitively delicious! \n\nFast, fresh, amazing and cheap food. The owner and staff are all super friendly and they are open til at least 11 most nights. Altogether awesome place to take care of your gyro cravings. We've had the chicken gyro, American, and Greek gyros. All fantastic. They even have a decent selection of Greek imported foods and beers for takeout. It's going to be dangerous living within a half mile of this place now...must. resist. the. urge. to GVG! Oh what the hell....get you some!", "useful": 6, "funny": 6, "cool": 5}, {"review_id": "3FLoCCyk13lasJU8RHH0JA", "user_id": "JtAoso0Ze87DWqnmI5qorA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-01-06", "text": "Came here after hearing about it from a friend. So my friend and I decided to meet up for lunch.\n\nBeing from Henderson this drive is a little bit far. But it was well worth the drive. Nothing better than finding a hidden gem in your city that serves great food. In this case, great sushi with the freshest cuts available.\n\nWalking in to an empty restaurant is always questionable but once we started ordering, I am glad it was empty as we received our orders quickly. Everything was handmade by Chef Hiroyoshi. We were offered an omakase menu by declined it since we were pressed for time. \n\nHowever, I started the meal with a can of their Ikezo Sparkling Peach Sake. I took it without any complaints because the server suggested this drink, knowing I like my drinks sweet. She brought out the can and began shaking it. I was worried that it would explode all over us but she assured me that it would be alright as she was shaking the jelly loose from the bottom of the can. As she poured the contents from the can into the mini martini glass she brought for the drink, I was reminded of a very loose jelly shot. And that's what it practically was. A sake with jelly in it. Suffice it to say I really enjoyed it and got another can haha. 5/5\n\nWe were started off with an appetizer sent to the table by the chef. Thinly sliced yellowtail tuna with a Hamachi paste. It was the chef's own take on the typical Yellowtail and Jalapeño. If it was supposed to be spicy, I didn't get any hints of it. But that is overlooked by the freshness of the fish. Delicate. No bad aftertaste to really show you how fresh the fish is (you'll hate how many times I'll be using the word fresh). 4/5.\n\nI followed this appetizer with a tuna Toro tartar. I was slightly disappointed with it since the menu specified a quail egg, instead the server apologized and said it was topped with caviar. Couldn't go wrong with that. The saltiness and the little popping crunch of the caviar accentuated the very silky smooth of the very finely chopped tuna toro. There was enough tamari on the plate to help pull all of these flavors together without it being overpowered. 5/5\n\nNext up I ordered Hamachi Hara (Fatty Yellowtail) Nigiri and Yakima Harasu (Seared Fatty Salmon) Sashimi (yes, today was a fatty and fresh day haha). I appreciate sushi places that do not try to stuff the guest with larger portions of rice to fish ration and the chef didn't disappoint. When the Nigiri came I was delighted that the fish was the main highlight and not the rice. Very little Wasabi to detract from the dish. And the sashimi looked larger than I have ever gotten from any other sushi restaurants. All of these were  washed down a second can of sparkling jelly sake. 5/5.\n\nWith all of this talk of Hamachi, I proceeded to ask the server, if by chance, they had any kama left. She checked with the chef and came back with the news that they do have it available. So. As you all know Kama is the collar of the fish. One of the most tender meat of the fish not including the fat of the belly. This for me was the best kama I've had so far. The chef was very meticulous at removing all of the scales. In the past as I dived in to eat the skin on other Kamas, there was plenty of scales left that were overlooked by the prep cooks. Not this one. The right amount of glaze was on the fish when grilled made everything stand out about the fish. The Filipino side came out and by the time the server took the plate away, there was no meat or fat left on that collar.  5/5\n\nTo end the meal as my friend needed to go back to work, I ordered a Natto Roll (Fermented Soy Bean Roll) which was not on the menu. I like my Natto very wet, but the flavor was there. Texture was soft as it should be. Nothing worse than a fermented soy bean that still has a crunch to it. 4.5/5.\n\nAll in all, the meal was wonderful. And just to reiterate, this place is definitely worth the drive!", "useful": 5, "funny": 2, "cool": 4}, {"review_id": "3zXKthBzuU_EiPJfPMCrjg", "user_id": "0OhcNToaDdLU0vS7uPkYNQ", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2011-06-05", "text": "Yes, back again today and finally I forced myself to try something different than the American Gyro. Got a combination chicken/pork gyro (hey, I didn't say I made a DRASTIC change) and, man, it was awesome as usual. This place has got it going on. It's not Lola but what it is is special all the same. I've said it before and will say it again, great food, very reasonable prices, extremely nice people...what, you need a written invitation??? GO!!! Enjoy. \n\nYou're welcome. :)", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "2ZVfVTXZmyWYAGdANVx8MQ", "user_id": "5daHu02u5o04mm4E7cHm5g", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 1.0, "date": "2011-12-01", "text": "I like what the owner is trying to do with the place, I really can respect that. And I've given Greek Village many tries before coming up with this review. I always get a stomachache after eating here. And each time, its been different food. And the counter service is 50/50 at best, sometimes they're really nice, others I felt like I was an outsider.  Not cool Zeus, not cool.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "HsvmYHEIfHxrPHgqPEc9fQ", "user_id": "CQZpblGIHeMlD7KqNP7J7Q", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-09-26", "text": "Came here with a friend who is super super picky about her sushi ( shout out to you Mel if you're reading!). She told me this place is really good and I have to trust her because her sushi palate is very refined. This really cute and cozy restaurant is tucked into an odd corner of the city. There's not really much going on around here. However, if you do make it here, you're in for a treat. \n\nThe space is very simple, clean and elegant. The sushi bar takes up most of the restaurant but we sat at a table because we didn't want to limit conversation by sitting in a horizontal line at the bar. I wasn't that hungry so I ordered only sake nigiri and a spicy tuna roll. My friends however ordered the churtoro, hamachi, fatty hamachi, grilled black cod, Masago nigiri, seared salmon nirgiri, white miso soup and other sushi I can't remember. What I had was really fresh and simple. The quality of the fish is top notch. Definitely melts in your mouth. The black cod is small but flavorful and extremely juicy. It was cooked perfectly. I didn't get a chance to try but my friends highly recommend the chutoro and said its the smoothest fish out of everything they had. \n\nI definitely want to come back here again as a treat.  The menu ranges in price.. Some things are really reasonable (spicy tuna roll is only 5.50) but other higher quality fish are more expensive ( 2 pieces of chutoro nigiri is 9 bucks). Your bill adds up quickly but you definitely pay for the quality.", "useful": 8, "funny": 1, "cool": 7}, {"review_id": "96-OOrtglLK5fAXw20_zjw", "user_id": "SEW_Ej5nXB2MxXMWQSaljg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2014-06-17", "text": "This is a good lunch spot. The food is fresh and flavorful. The platters and sandwiches are good and I love their Mediterranean salad. I definitely recommend this spot, especially for the lunch crowd looking for a good, quick meal.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "DzzrhsiwNdmSOxo0-1hHfw", "user_id": "n86B7IkbU20AkxlFX_5aew", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 3.0, "date": "2016-08-31", "text": "We came during lunch (only on thurs & fri )but instead of ordering lunch, we decided to sit at the sushi bar and do a omakase. \n\nThe starter of housemade tofu, sweet shrimp and uni was clean, refreshing flavors together. \n\nWe had a appetizer trio of a tuna tartare which was very well prepared, a jellyfish and cucumber salad which I actually really liked the crunch of. \n\nMiso grilled cod was next and this piece of fish was delicious. Very nicely grilled and seasoned. \n\nThe sashimi set was solid. Very nice quality of fish. There was one that now I am sad I cannot remember the name of, that wasn't a \"typical\" fish, but it was the star. It was salty in its own way that was superb. \n\nThe nigiri was solid, very fresh and the rice was nicely made. There wasn't anything really unusual in our set though, so that was the only disappointment for me. I like that they have a special soy for their fish, something a bit lighter. If only all places could have that. \n\nThe reason why this was just a 3 star / A-OK is the fact the experience wasn't there. It was busy and only chef making everything and 1 person seem to be grilling/frying in the back. He was very nice, but everything was hurried as he had so much to do. I do admire his work came out quick, but precise though. I don't know how some folks were having things served one by one than a plate of nigiri, but perhaps during a less busy time. I would have preferred if it could have been that way seeing as there was only 2 of us at the sushi bar doing a omakase set. The servers were tied up at the tables and I had no drinks for a good part of this experience. At one point I had to apologize to chef and ask if there was any way I can get a beverage. They were friendly enough and were apologetic once it was brought to their attention that I've been trying to get their attention. \n\nQuality is there, but I might try all our quality sushi places before I come back here. Next time hopefully for dinner we can have a less hurried experience.", "useful": 2, "funny": 4, "cool": 2}, {"review_id": "PjM-aIZOd8bQueHWLGww6Q", "user_id": "oeAhRa8yFa9jtrhaHnOyxQ", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 4.0, "date": "2016-07-19", "text": "Bridging the gap between the classic Edomae sushi giants (Yui, Kame, Kabuto) and everything else.  Hiroyoshi fills a niche, offering Japanese sushi experience to those more experienced while discretely offering other, less intimidating choices to the uninitiated.\n\nTip:  Discretion requires assumptions.  If you're Japanese, you will get the full experience with no ingredients held back.  Not Japanese, rolls and less challenging ingredients (no uni, fish sperm, monk fish liver, etc) will make up your omakase.  That said, begin a dialogue with the chef if you want something in a different \"category\".\n\nNote:  This is not an Edomae experience.  Fish and seafood isn't brought to temp ahead of service rather the more common, \"everything chilled\" service.\n\nStraight to it, the rice, excellent short grained rice, gently seasoned with a pleasing salinity, very few broken grains, lightly compacted.  The seafood, uber fresh and well sourced.  As it should be, seafood is sourced from where the product is the best at the time.  Understand that highly seasonal fish will come and go.  Fish too rice ratio perfect (no need to open your throat and swallow as only half fits in your mouth).\n\nAla carte and omakase both offered.  It's fun to constantly converse with the chef, ask what's fresh, and different, and be willing to splurge and experience anything.  Omakase is however the way to go for first time visitors.  \n\nEat all sushi as served.  Each is seasoned or sauced as the chef feels best showcases the fish.  Do NOT be that guy who dunks everything in soy sauce.\n\nHighlights on a recent visit, live East Coast scallop sashimi cleaned and served in shell, candy of the sea.  A firm and gently oceanic sayori (needle fish) as sashimi and unctuous hamachi hara (yellowtail belly) as nigiri whose fat melts on the tongue and releases the best characteristics of the fish.  Live Santa Barbra abalone as nigiri has great texture and \"crush\" with a clean sweetness.  Shima aji as nigiri, huge fat content but so fresh there is no hint of fishiness, firm texture turning creamy on the palate.  Uni tempura dusted with matcha salt, very good.  As delicate crisp exterior and warm, creamy interior whose richness is tempered by the bitterness of the tea.  Needless to say, the cold water Hokkaido uni is outstanding, fresh, and creamy; the otoro properly graded and perfect with the lightly aged soy.  \n\nSushi bar typical service.  \n\nAnother welcome addition to the maturing taste of the sushi world of off the Strip Vegas.  Bravo.", "useful": 32, "funny": 22, "cool": 28}, {"review_id": "btaQ8x4bHWkJS-c3Gphe-w", "user_id": "SJEr0t98Op8WDVjhttkKLA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2015-08-30", "text": "If I could rate this place 3.5 stars I would, but I'm rounding up to 4 because I think the baklava is the best tasting thing in the restaurant. Must get! Even though it's $1.50 for a little square piece, it's definitely very worth it. \n\nI ordered the shish kabob platter with the Mediterranean salad and Babba ghanouj. The meat was a bit over cooked and very chewy. The salad was good but tasted very acidic. The babba ghanouj, which is an eggplant dip was just ok. Overall, I wasn't that impressed with this platter.\n\nI did like that the menu gave descriptions of the items of their menu. It helped me a lot when deciding what to order. I don't think I'll be back here but if I come back, it'll be for the baklava!", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "BTzVBNbU6soDZuP5bzZVow", "user_id": "9sDNyyANgUMNg0RsuR0E7A", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 5.0, "date": "2018-06-08", "text": "They had an amazing cherry Pommies. I had it with the cherry cheesecake. Yummy! My husband had a flight of Amsterdam, Collective Arts, and 2 Shackland Mezza beers. We have walked by hundreds of times and today we went in. I'm glad we have. Everyone is very friendly!", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "wLKdKEeg-TEGTHnGWNtr8Q", "user_id": "IdD1Z_PMqF0zUn3uZWSeAg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-11-05", "text": "After hearing all of the amazing reviews I finally tried this place. I wasn't surprised that it was good. It was awesome! I am a huge fan of Mediterranean and middle eastern food and Zeitouni has to be my favorite. We had the gyro and shawarma and both were fantastic!! The gyro was the best ever!!! The staff are very friendly as well and always have smiles on their faces! I love this place and I am so happy that it so close to my house :)", "useful": 3, "funny": 2, "cool": 3}, {"review_id": "BFD5MOzZYzDxVD1NlJ7g8A", "user_id": "vW1kHIcXk8ZWIlkXj9qKIg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2015-10-31", "text": "Great Mediterranean Food!  Quantity can be better, but the freshness and the taste of the food is great.  The platter gives you a great option for trying several items:  falafel, hummus, grape leaves (which are my favorite).  My husband loved the chicken shawarma as well.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "LNRSnk0JPdOhmT8GDMceXA", "user_id": "EDZKP6CGokUIoQfRmkLhdw", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 2.0, "date": "2016-01-08", "text": "Disappointing. I ordered the Beef shawarma and was shocked at how small the wrap was. Barely had meat in it, pita was paper thin as if they opened the layer and wrapped it in half of it.  Tasted ok, that's it. I ordered the potatoes, which came in a nice size portion, I must admit. They were flavorful with garlic, cilantro, and tangy. Possibly had a shot of vinegar in them or lemon. Couldn't place the acid. Friend had the falafel, she said it was good. The grape leaves, we both agreed were small, but they were good, tho. I MIGHT try again, but it seems the prices were high for what I got. I wanted more sandwich, less potatoes. Not a fan.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "nh2YnSGPinIS49_dh6g6tQ", "user_id": "TbhyP24zYZqZ2VJZgu1wrg", "business_id": "-PL-4fFYPYrOjnNd0lO4Lg", "stars": 5.0, "date": "2011-11-05", "text": "This must be my new favourite Irish pub in Toronto. \n\nIt has a real authentic feel, although it's far nicer than most of the pubs you'll find in Ireland. There are lots of leather lounge chairs in the front room when you enter but once you head up the stairs the decor is more traditional.\n\nThey have a HUGE beer list. I love the \"beer samplers\" you can get - 4 x 5oz mini beers for only $7.49. This way you can sample quite a few. \n\nThe service was excellent and the barmaids really know the menu well. \n\nThey even had a cider ON TAP. Thank you. Finally. It's so hard to find cider on tap in Toronto. This was a Canadian cider - BC Rock Cider, but it was delicious, crisp and light.\n\nThe pub is quite small (hoorah!) and was packed with a wide variety of non-douchy people (yay). \n\nI didn't get to try to food, but I will definitely be back.", "useful": 8, "funny": 5, "cool": 5}, {"review_id": "MIVqQcJGrHbttGO9PZekEQ", "user_id": "qRfMtCMCzdJ28wzc6wJCcQ", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2015-06-04", "text": "We split two platters (Mixed and Mezza) and the Zataar flatbread, so we could try more things. Things we would get again: ANY of the meats (all cooked perfectly and so flavorful!), the potato harra, the fatoush salad, the hummus, and the tabbouleh. I would skip the Zataar, the Babba Ghanouj and the Falafels. Also, we tried all four types of baklava, and I felt they were all somewhat dry, and butter was an extremely prominent flavor, but the long rolled ones were the best imo. All said and done, we would definitely come back.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "L-4lq3XBjkW0dPvy7CaXRw", "user_id": "QxrmO9IKZc68E2npuN9p8w", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2018-04-08", "text": "The dessert (lady fingers) is good. The chefs are nice, and i liked the vegetarian platter. But, i do not believe that the price point corresponds to what is delivered....", "useful": 1, "funny": 1, "cool": 1}, {"review_id": "8d-oCuaKvBxzSsCeEimImQ", "user_id": "3a8JVsABTdbJ8pLVX-Dcsw", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 3.0, "date": "2018-07-02", "text": "Food was soso, staff were polite. Service was slower than average. I've been to much better sushi places, and been to much much worse places. I'd say 7/10 for the overall experience.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "O2Lm-k0PR5AjSuvsnHMw_A", "user_id": "VlcasgkqiTuPi-nVT7rEtw", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2015-02-26", "text": "Seriously awesome! Being Lebanese it's hard to find good authentic tasting food. This is one of the few that has it!", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "C0Yq85WSo5R1XcbxB6tJKA", "user_id": "PpBzb-w7JlSuML_-GpORcw", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 4.0, "date": "2010-05-06", "text": "I've eaten here twice so far, and both times I was really pleased with the service and the food. \n\nReally sizable Gyros and Souvlaki for less than $5!! Right on!  This is the real deal, carved off of a vertical rotating spit.  \n\nThe \"Greek\" gyro made with pork rather than the usual Lamb/Beef meat alloy was a great surprise.  Moist chunks of seasoned pork go really well with the standard toppings (though moist chunks of pork go well with pretty much anything, don't they?)\n\nThe fresh-cut Greek-seasoned fries are good, and though I personally haven't strayed off of the sandwich menu, I've been told by reliable sources that their dips (hummus, etc.) are amazing.  \n\nHard to say if these gyros are better than my beloved Mezza's in Westlake.  At the very least, they're just as delicious.", "useful": 5, "funny": 1, "cool": 4}, {"review_id": "2XeLdZRaITOmVE557c1x8A", "user_id": "Gb9Y_f1xslY1mDvvHBXaLg", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 3.0, "date": "2015-12-23", "text": "I set high expectations for this place due to my desire for great Mediterranean and the Mediterranean food that I've eaten in the past paired with the phenomenal reviews and ratings I've read and heard.\n\nDon't get me wrong, food and experience was good and I'll be returning or considering it again in the future, but it won't be my go to spot or \"gotta have it again tomorrow.\" \n\nI ordered the falafel platter. One of my choice extras was a Mediterranean salad- which was quite tasty, but was disappointed in the size. I was expecting a side salad portion, but in reality it was a to-go side in the meal container...so probably 5 small to medium bites. For my second option my choices were baba ghanoush (eggplant) or hummus. I opted for the baba, when I opened the platter I assumed they just gave me hummus because it was the consistency and color of hummus, but didn't taste like baba or hummus.. So I'm not sure what that was. That item was my least favorite. Now to the falafel! It was quite good. I enjoyed the seasoning and flavors, perhaps I tasted some mint. Very enjoyable! It came accompanied by some pita bread. \n\nI also asked when ordering to make sure the yogurt cucumber sauce was in the platter on the falafel, they insured that it was included. No such sauce.. And that sauce is my fav. There was some tahini, which was good.\n\nMy co-worker ordered the grape leaves appetizer. They were presented well and she liked them.\n\nCustomer service and timeliness was excellent. Wassim rang up my order, no extra surprises. The bill matched what was quoted on the phone when I placed the order for pick-up. They are open until 9pm. It is close to my job. The restaurant is set-up cafe style. Bathroom was clean and stocked. \n\nFor any interested, they are currently hiring. Seek within.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "xwYGEeUqB0LBWEdhPiDvzw", "user_id": "TB9ibgXVrq1B7-fajbsu8g", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 4.0, "date": "2015-05-08", "text": "This is my new jam!!  I know they aren't new but I am new to them.  I loved it!!\n\nI ordered the falafel platter which may seem uneventful but for those of you that know falafel's can be a very delicate topic.  They are by no means a \"one size fits all\" type of deal.  But Zeitouni's hit the nail on the head!!!  So scrumptious!\n\nThe platter comes with a 2 sides...basically hummus and a small greek salad.  Everything was excellent.  The hummus was creamy and I don't know what all they use but it was just very good.  The falafel bites were fried to perfection, and the tahini dipping sauce was awesome.  The salad was weak in terms of size but it was still very good.  The pita bread that was served was also weak but I will let that slide.  \n\nOverall, booming place.  Everything looked good, smelled good and was good.  Not a lot going on in this shopping center but you can stop in at earth fare before or after if needed!  You could also sit outside at Zeitouni's which is always fun.  They served wine..didn't see beer but I assume beer as well.  \n\nI will definitely be back.", "useful": 3, "funny": 0, "cool": 0}, {"review_id": "y_Dw7-TRxFgFdmXf2QcAHg", "user_id": "i8hCMZN-0bHENsHZKHpC-g", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2010-08-16", "text": "I went to a potluck today and needed to bring grub. Seeing as how the peeps i was visiting don't want dog hair in their food, i decided cooking at home was not an option. What to bring....everyone loves Greek food!\n\n I stopped on the way and ordered three portions of spanakopita, one grape leaves portion and two little containers of powdered cookies. It took all of ten minutes. Bravo! The service was very friendly even in this stifling heat. Total was 15 bucks and i think everyone got a taste of these goodies. And no dog hair. I didn't think this place would make it based on location and the economy, but it seems to be thriving. I wish them many more years of success.", "useful": 9, "funny": 10, "cool": 7}, {"review_id": "HnTGTvnlpCPOwu_Echiy9g", "user_id": "-6559fkJ6rCWIZDbqVUomA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2016-07-27", "text": "I love this place! They have some of the best food that I've had in The Mediterranean/Middle Eastern type food. I actually wish there were more like this around that would be closer to where I live. The food is so good that it's worth the 10 mile drive.\nI've had Baba ghanouj in San Francisco, several times in Washington DC, and a few times here in Charlotte. They make some of the best that I've tasted in all of my travels.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "-ecgWXTsIZf9DgDsIRMh4w", "user_id": "jfaz1aQqnkbtzQfQyCE8IA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-07-19", "text": "I had been asking the Mr if we could come here for quite a while. During a foray into the adjacent Dippin Dots, I saw people filing into this joint and thought it was worth a yelpy lookup. It has deservedly acquired four and a half stars from the yelp community and here's why:\n\n* Education: They take the time to explain the meat/entree offerings in a way that doesn't demean, but offers insight into which you might prefer. You can also see the skewers of meat right in front of you in a visually *enticing* cooler. They also have detailed explanations of all those tongue-twisting Mediterranean food descriptors, e.g. shawarma, fatoush, tabbouleh...\n\n* Variety: Please note that vegetarians can actually grow both fat and happy here. From a simple hummus to lumps of perfectly crispy falafel or perhaps baba ganoush, eat your fill. As I didn't sample the meat options (we all know why), I had to depend on the Mr's refined palate, which suggests that the chicken skewers are the way to go. They also serve Lebanese beer and wine. Cheers!\n\n* Atmosphere: It's Mediterranean quick-casual. FINALLY. You don't have to go somewhere promising Friday night belly dancing in order to partake in this savory, fresh fare. I, whose belly will remain shirted, am delighted about the atmosphere. Nothing at all fancy here. Simple plates, self-serve soda/tea fountain, friendly staff (who recognized us when we returned only two days after our initial visit).\n\n* Food: Delicious. An excellent choice for a Ballantyne-area lunch or quick dinner that won't leave you feeling bloated and ready for a nap. Great value as well. I'll probably not order falafel anywhere else, because my poor, spoiled taste buds would likely revolt.\n\nAll in all, this spot is definitely worth a visit. If you live in the area, it's an added bonus. No frills, just great Mediterranean food. Enjoy!", "useful": 6, "funny": 3, "cool": 3}, {"review_id": "uOmLqJt160hMIUL_IIvmqA", "user_id": "km1ZoLMBB_eIevEfK6sCAA", "business_id": "ExtP8z3SVyut_RICc9i_DA", "stars": 5.0, "date": "2012-08-18", "text": "Such an amazing find! I'd eat here everyday if I lived closer. Best falafel I've ever had and the hummus was excellent.", "useful": 1, "funny": 0, "cool": 0}, {"review_id": "PCpClI8xgG-TLDjFEBaHkA", "user_id": "WPl2gULxrrh_GoypMzHF-A", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2017-04-15", "text": "I made a reservation for two at the sushi bar. We were the only people sitting at the sushi bar for the entire course.\n\nDecor: 5/5\n-limited dining space for a max of 30 people\n-sushi bar is very well lit\n\nService: 5/5\n-excellent, top notch, friendly service\n-Hiroyoshi washed the cutting board due to our shellfish allergies, we've never had a chef do this for us (bonus points!)\n\nOmakase: 4.5/5\n-we opted for the $100 omakase and wasn't disappointed. My favorite part of the course was the striped jack, medium fatty tuna, fatty tuna, orange crab and the alaskan crab. \n-the uni was alright. We tried three different types of uni back to back however I was underwhelmed by them all\n-bonus points for having fresh wasabi", "useful": 1, "funny": 0, "cool": 1}, {"review_id": "dhq6AdhZz4oiQJuoJte8Iw", "user_id": "a-vR3GRg5xyNkCot1vXy4A", "business_id": "yhoCIkTwHihWejVqGYZ4rw", "stars": 2.0, "date": "2013-09-16", "text": "I used to love Dibella's...we would stop in at least once a week, a large sub would easily feed me for 2-3 meals. The bread was great, they put on tons of toppings and the oil is crazy good. They're a little pricey for a sub but since they are so big, I really wasn't that bothered by it. I don't eat meat other than fish so when I go to a sub shop I have my choice of tuna or veggie...Dibella's had the greatest tuna sub I had ever sunk my teeth into.\n\nThen they changed their tuna to Albacore which I think is completely flavorless. And it is mixed as a little bit of tuna and a ton of mayo. Their tuna sub went from a great experience to a gloppy, mayonnaisey  mess. PLUS, they used Albacore as an excuse to hike the price up even more. I contacted their corporate office MANY times begging them to bring back the old tuna and they refuse. When we really get a craving for their bread & oil I order a cheese sub and add my own tuna....which is maybe once a year now. They went from a very loyal customer to basically losing my business completely.", "useful": 0, "funny": 0, "cool": 0}, {"review_id": "iH0_BlCNVeE9SayKmHuh-g", "user_id": "tQb3Os_ph9glJqGIW-PdHA", "business_id": "qLUr-ZPGVJejkSXIUenw6w", "stars": 5.0, "date": "2016-04-21", "text": "Late night  gyro craving spot!  Open until 3 am on Friday and Saturday.\nWow~ I can't wait to go back to try the chicken gyro.  I had the original Greek which is pork.  Pork?  Who knew that is the authentic way to order.  Hubby had the American version of lamb/beef and brother got a feast of all 3 meats with pita and sauce.  The sauce is so yummy and the pita is fresh, soft and warm.  If you want Baklava, go early.  They were already out.  Staff was friendly and hardworking folks.", "useful": 6, "funny": 5, "cool": 8}, {"review_id": "L3y-DdOkoqaSEqIw7ILoHg", "user_id": "cQU8IWVEJYcklBJbW9CzdQ", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 5.0, "date": "2016-07-18", "text": "I almost didn't want to write a review for this place because....well, I'm selfish and I want to keep Sushi Hiroyoshi all to myself!! \n\nThis is truly an incredible Japanese sushi restaurant. Top quality ingredients, great service, and so much attention to detail. It's literally a little mom-and-pop type of shop, and the sushi chef, Hiro, is magnificent. I came here on a quiet Wednesday evening with a group of friends, and we had a wonderful dining experience.\n\nFirst off, THE FISH IS SO GOOD!!!!  I ordered the 3 small appetizers (1. Uni w/ steamed tofu - so creamy and not fishy at all, 2. Steamed spinach and mushrooms - a little bland but fresh, and 3. pickled jellyfish/cucumbers - fresh and light), an order of Salmon nigiri - not the best I've ever had but very good quality, an order of Chutoro nigiri - OMG, MELTS IN YOUR MOUTH GOOD, and Hiro's Tomago egg - tastes like a fresh egg cake :)  Would also highly recommend the Miso Cod which is flaky and buttery and cooked with great flavor!\n\nWhat really brings it over the top is the attention to detail. The plating is beautifully thought out, and you can tell all the dishes were made with care. Our waitress explained every dish she placed on front of us, and she was very friendly :) I ordered the miso cod and a crab roll to go, and she made sure there was ice packing for my to-go sushi order! She also easily split all our checks with no issues. A+ service!\n\nDecor is simple and clean. It's a small restaurant, and for now, it's not very busy, so it's perfect.... (I'm sure that will change soon once word gets out about how awesome this place is). \n\nWould definitely come back, and next time I'll go for the Omakase. My new fave sushi spot in town!", "useful": 7, "funny": 3, "cool": 4}, {"review_id": "ZbRsCN6zjlPv5aa6e0y7qQ", "user_id": "Rw1QE99aazERB_z3S8D8nA", "business_id": "vOMDU31gdylrzBhAKC9QbA", "stars": 2.0, "date": "2016-05-30", "text": "With the location of this restaurant being near my home and the great reviews I was anxious to try this place.  The atmosphere of the restaurant is pretty cool and the staff was very nice.  My problem was the sushi didn't impress at all.  I hate to say it but there are just a lot better sushi places to eat at in Vegas.", "useful": 0, "funny": 0, "cool": 0}]